[
  {
    "title": "smiling horse",
    "link": "https://old.reddit.com/r/Dreams/comments/1n4v3ho/smiling_horse/",
    "body": "I just had this weird dream about a normal white horse peaking through my window at night and i opened the sliding door to check it out and it instantly squatted like a spider having more joints than a horse should have and smiled at me weirdly and as i started following it it would disappear like evaporate and then reappear just a couple meters infront of me but differently this time all i saw was a white face and a smile and i dont remember what its body looked it just got more distorted the more i followed it thats all i remember the weirdest thing is i didnt feel scared at all",
    "images": [
      "images\\horse\\smiling_horse_0.jpg",
      "images\\horse\\smiling_horse_1.jpg"
    ]
  },
  {
    "title": "I went to a public bathroom where you had to hold two miniature horses to be allowed to poop",
    "link": "https://old.reddit.com/r/Dreams/comments/s0qet7/i_went_to_a_public_bathroom_where_you_had_to_hold/",
    "body": "I had a dream about a huge room with many toilets in it (50 or so) and while I was sitting down and peeing on one, everywhere around me people were casually pooping and peeing as well. No doors, no walls, just watching each other. Sooo uncomfortable.",
    "images": [
      "images\\horse\\I_went_to_a_public_bathroom_where_you_had_to_hold__0.jpg",
      "images\\horse\\I_went_to_a_public_bathroom_where_you_had_to_hold__1.jpg"
    ]
  },
  {
    "title": "3 horses nightmare please help interpret",
    "link": "https://old.reddit.com/r/Dreams/comments/1mugg84/3_horses_nightmare_please_help_interpret/",
    "body": "I fell asleep in my bed and had this vivid dream of getting lost in the woods low brush and I was trying to find way way back in the middle of the night when I saw a light up ahead which I found out was 3 white horses with glowing eyes come running towards me. I do not know why but the horses gave me fear and the last thing I remembered before waking up was immense dread and the horses fixing to be apon me. It felt so real but then I woke up. I’m still in my bed. I have no fear of horses irl and I sleep 8 hours every night. I do have bootcamp starting this Sunday I get on a plane to go to boot camp. What could this dream mean?",
    "images": []
  },
  {
    "title": "Horse Dream",
    "link": "https://old.reddit.com/r/Dreams/comments/1npcake/horse_dream/",
    "body": "I had a dream I was running in a crowd from something, we were in a very tight and tall concrete alleyway and there had to be maybe 40+ people. out of the corner of my eye, underneath a small crawlspace, I saw a small horse lying on its side. So i stop and go to it and tend to it.\n\nAnd it speaks \"We have suffered\". And i go \"Who has?\" He didn't respond, but nodded weakly, the entire horse looked extremely sickly and covered in deep wrinkles and cobwebs like he'd been there for ages. And i say \"Don't worry, I'll get you some help. How many people have found you?\" And it responded with \"Not enough.\"\n\nSo i ran back to what I'm guessing is my apartment that i own in this dream and i searched my stuff and found horse medicines, but i exit the door and I'm inside my garage in my current house and it's a gorgeous day outside, perfect sun and clouds out.\n\nThen this car rolls up and this girl comes out and just starts stealing shit going \"It's okay\". So i get on my bike and a close friend of mine, we'll call him Steve, suddenly rolls up in the driveway on a bike and he is just like \"Hey man, what's up?\". And i say \"Oh nothing much. Had better days.\"\n\nSo i get on my bike and we begin riding around back to where i found the horse, but when I get there, it's gone. So i just start heading back home, but when i get back, it's now my childhood home, and our big garage door is open wide and there's still that person stealing shit. So my friend Steve, without prompt, takes out a .44 magnum, shoots her in the head, splitting her entire body in half like a diorama of the inside of a human body. Then this other guy runs up to her and Steve shoots him too while a cop car comes up. Steve's bullet didn't quite kill the guy, only hit him in the chest so he's slumped back against a car inside the garage.\n\nThey all rush inside to assess the situation and i follow soon behind. As i come in, I hear a cop shout \"need a medkit!\" So i rush to a nearby wall where there's a few old first aid kits on the wall and run back, seeing that they're not tending to either of the guys that just got shot. They're tending to the horse.\n\nIt's now inside fhe garage, looking even worse, covered in dust and even more cobwebs now and still in a small crawlspace exactly how it was when I first found it. I set the first aid kits down next to it and open one, for some reason it had like a glass seal inside that broke when you opened it, and a piece cut my thumb. I look down at it and show it the medicine, but it looks at my finger bleeding and smiles this awful smile with human teeth, an extremely wide, but thin smile like it took extreme pleasure in seeing my blood.\n\nAnd then i woke up.",
    "images": []
  },
  {
    "title": "Riding a horse, running from flash flood, then a weird expeience",
    "link": "https://old.reddit.com/r/Dreams/comments/1ns2aid/riding_a_horse_running_from_flash_flood_then_a/",
    "body": "My dream started with me riding hours with some people. One person lost control of their house, and I chased after them on mine. They made their way through a grass plain, then went up a path made from a dried up river, going up the mountain. I followed behind. Then I see them running back toward me, passing me a telling me to run. I turn my horse around and start running downhill. I see a flash flood hearding my way. My concern was if the horse would trip going down the steep mountain side. Luckily, we made it to safety. I reached down to pet the horse, and the ferry bit me. Then I took my other hand to pull the mouth open.\n\nThe weird: I woke up and checked the time. Then, I went back to sleep. But when I closed my eyes, i would see that I was in a kitchen. Then someone handed me a stack of paper plates. Then I overheard the voice talk about me and my dream. This all happened while I was awake and a few secoafter closing my eyes.",
    "images": []
  },
  {
    "title": "My Mother’s Horse Dreams",
    "link": "https://old.reddit.com/r/Dreams/comments/1nlsqko/my_mothers_horse_dreams/",
    "body": "My mom is a very serious non-nonsense kind of person. She’s not very spiritual, she thinks all things have some sort of rational science’y explanation and there’s no mystery or any sort of “magic” in the world. People who believe in that kind of stuff are crazy in her mind (I try to keep all my spiritual beliefs and things that fascinating me that I personally believe in - I keep those completely away from her because I know she’ll just think I’m being silly) - anyways I am disclosing all of this so that people realize how weird this is coming from her….a few nights ago, after having known her as my biological loving mother for 31 years of my life, she casually mentioned to me that she doesn’t dream very often, BUT if she does, then it’s ALWAYS about horses, and the horses in her dreams speak human to her, which scares her and she always ends up running away from them while they sorta follow her/chase her, even though they’re supposedly not evil in the dream, but they still terrify her. My mother grew up relatively poor in an urban setting. She had never owned a horse, or been to a farm as a child nor as an adult. The only times she ever been physically near a horse would be when she was already 40+ years old and just by coincidence, like visiting nyc and walking by Central Park where all the horse and carriages are. Those are her only real life encounters with horses…..which is why when she just told me about this weird dream thing I found it absolutely bizarre.\n\nShe never had any horses be a part of her life in any shape or form. She found those dreams disturbing enough at one point a few years ago that she considered going to a shrink about them, but ultimately decided it’s probably nothing. Now I’m just sitting here and super curious if this could potentially be ANYTHING with some sort of an interesting interpretation or could represent some last lives or idk, any weird spiritual concept related to dreams and dreaming.\n\nAnyone know anything about something like this?",
    "images": []
  },
  {
    "title": "Glowing red horse",
    "link": "https://old.reddit.com/r/Dreams/comments/1nkcdu7/glowing_red_horse/",
    "body": "I had a dream over ten years ago and I've always wondered if anyone else had one like it, or had any thoughts about it. In this dream, I woke up and saw a thick, pony sized red horse standing in my very small room. It was glowing (an orange/red amber-like) and was translucent. I could see the organs, heart pumping inside this horse.",
    "images": []
  },
  {
    "title": "Brown Horse Dream",
    "link": "https://old.reddit.com/r/Dreams/comments/1ni8bwa/brown_horse_dream/",
    "body": "I separated from my husband last year - he left me for someone else. It's been an awful year, full of despair and deep depression. Our social life revolved around his friends and his family as we live in a small town, and, apart from my children ( 2 of which are grown up and live away) I have no one.\n\nLast night, I signed up for an evening class in the next town. It's taken alot for me to do it. I desperately need new friends and to start a path of being able to move away and start a new life. My youngest child is 14 so I'm stuck here for at least the next 4 years.\n\nI had a dream of a Brown horse. I was walking with it, untied, down my street. Other people ( unknown ) were with me including my husband and brother in law. I had bought the horse and was bitterly regretting my decision as we were hopelessly trying to find pasture for it to feed on, all the neighbours ( unknown) were not being very helpful when we asked.\n\nI couldn't believe that I had bought this horse as it meant I was now tied to this area and my desire for freedom was now quashed. I was scared of the horse and had no idea of how to look after it.\n\nSeveral times, the horse ran away from me but came back when I called it's name ( unknown). At one point, a neighbours ( unknown) small dog growled at the horse, the horse cowered but stood it's ground.\n\nI woke up so relieved I had not bought the horse, it was so real. I have never dreamt of my street before, despite living here for 30 years.",
    "images": []
  },
  {
    "title": "Had a dream that I was walking home and this thing was at my front door and told me to come back at 7pm. I just turned around and left. It never said its name but I know its just “horse”",
    "link": "https://old.reddit.com/r/Dreams/comments/ptmtgf/had_a_dream_that_i_was_walking_home_and_this/",
    "body": "This is why I continue coming to Reddit. Thank you.",
    "images": [
      "images\\horse\\Had_a_dream_that_I_was_walking_home_and_this_thing_0.jpg",
      "images\\horse\\Had_a_dream_that_I_was_walking_home_and_this_thing_1.jpg"
    ]
  },
  {
    "title": "Dream about my horse dying",
    "link": "https://old.reddit.com/r/Dreams/comments/1mtkvfj/dream_about_my_horse_dying/",
    "body": "TLDR: horse died in a very realistic feeling way, horrible grief, angry at mom for unrelated stuff.\n\nI don’t remember all of it, but there are only a few things I do remember:\n\nmy horse Daisy ran and jumped in the pasture while playing, but she fell weird and her head folded under her neck, and she didn’t get up. I ran over and instantly just started sobbing over her. She was still alive, but not for long. The next thing I remember is I felt so sad and angry the rest of the dream.\n\nI felt sad for obvious reasons, but I was unbelievably furious. I did things I’d never do irl like throw glass dishes on the floor and just break a ton of stuff. I felt mostly angry at my mom even though she had nothing to do with it.\n\nWhat happened AFTER I was angry at my mom is she did something that made it worse. I said I wanted a necropsy done to know exactly what happened, and she said her new boyfriend (parents just got divorced) knows what happened so there’s no need to. I said I know she probably broke her neck, but I want to do it just to be safe. Something about this just made me absolutely livid. I screamed and cursed at her until a bunch of people from the barn who also had horses there came over to say how sorry they were for what happened.\n\nI am not angry or upset about the divorce. It should have happened a decade ago. I have never had a good relationship with my mother, though. I understand why I was so angry with her. I’ve always been angry with her. I have very frequent dreams about screaming and breaking things and cursing like I wanted to but didn’t when I was a kid. What I don’t understand is why my lovely beautiful amazing Daisy died in my dream. It was horrible. It was so realistic. Usually in my dreams I can tell when something is ‘off’ but I still don’t know it’s a dream. This felt like I had just lost her forever for real.\n\nPicture of Daisy because why not?",
    "images": [
      "images\\horse\\Dream_about_my_horse_dying_0.jpg",
      "images\\horse\\Dream_about_my_horse_dying_1.jpg"
    ]
  },
  {
    "title": "I've had a weird scary dream where I was in a field and angry horses were coming out of giant \"caves\" and chased me and my friend",
    "link": "https://old.reddit.com/r/Dreams/comments/1ml62fw/ive_had_a_weird_scary_dream_where_i_was_in_a/",
    "body": "this is the best visualization I could create\n\nhttps://preview.redd.it/n6l87qmjuuhf1.png?width=626&format=png&auto=webp&s=b1da6b4e71e98669a6460e8d847dcf500b754cae",
    "images": []
  },
  {
    "title": "Riding a Flying Horse Statue",
    "link": "https://old.reddit.com/r/Dreams/comments/1ncc6vs/riding_a_flying_horse_statue/",
    "body": "I haven't been dreaming much lately at all, and I barely remembered this dream that I just had a few minutes ago while sitting up in the driver's seat of my car, looking at things on my smartphone at the time at night. So, in the dream, which I can only recall fragments of, I was outside while it was starting to be sunset, I believe. And I was near what felt like statues of things. Suddenly I was up on top of this one statue of a large horse, even though I don't really have any involvement with horses nor really want to in true life. But I was then suddenly riding on top of this statue of a horse and found I could direct it with my mind. So I made it start taking me around while it was riding up in the air above the houses below. Suddenly it started getting a bit too close to certain places that caused them to start noticing me up there, which made them angry at me. In fact, this place I went over with other horses below, suddenly started sending others to chase after me, all angry at me for having flown over their heads. So I was pushing with my mind for the horse statue that I was riding on to move faster. And then I believe I woke up around this time. But the most memorable part of this dream was near the early stages of it where I was on the ground at first noticing the statues around me, my having a lot of time where I was contemplating all of them while just standing around looking up at all of them. So it felt like an unusual type of dream to me, likely of a rare type for me where it had started through hypnagogia at the time. And it then felt magical with the way that I suddenly was flying around on the horse statue. It was almost a lucid dream but wasn't, otherwise I would have known that I could simply fly around without the horse statue under me. But instead, I was simply feeling nevervous that the statue would either crash or that those who were angry at me when I crossed over the top of them were going to catch up to me. Yet, still, the whole relatively short dream had a weird special feeling to it unlike most of my dreams, which was part of the reason that it didn't even pop into my awareness until about an hour later, and only then was I able to catch a fragment of it enough that I finally rememberd this much about it, whereas most of the time I merely remember some type of dream happening but can't recall at all what it was. So I just got lucky this time. So it was a special flying dream of sorts, but had occurred safely via my instead being on a flying horse statue. I will take what I can get! LOL.",
    "images": []
  },
  {
    "title": "Do not touch the Horse Bag",
    "link": "https://old.reddit.com/r/Dreams/comments/1n19b4w/do_not_touch_the_horse_bag/",
    "body": "I remember right before waking up seeing an image of a horse head photoshopped onto a sausage with the text \"Do not touch the horse bag\" below it. I remember it so precisely I remember what corner of the room I was facing and how much light was outside. I guess I just cant touch the horse bag now.",
    "images": []
  },
  {
    "title": "Horse?",
    "link": "https://old.reddit.com/r/Dreams/comments/1n17fbm/horse/",
    "body": "This si a old dream I had that Ive think of a lot\n\nI was in a farm and everything was black and grey and I saw a horse in it's fenced area I didn't think to much and walked into a barn I later walked out to see the horse again but i see it was it's skeleton and it didn't have not body just it's head and it's neck except it neck was connected to the ground after I saw it I woke up completely confused",
    "images": []
  },
  {
    "title": "Being stumped by big black horse",
    "link": "https://old.reddit.com/r/Dreams/comments/1m0f1mg/being_stumped_by_big_black_horse/",
    "body": "Hello fellow dreamers,\n\nJust wondering if any of you had any insight about dreaming of horses. But especially being attacked/chased by horses. The past two nights, I've had similar dream experiences where I saw a horse (black) trying to stomp on me. Last night the horse was gigantic even. I kept trying to evade and horse kept trying to crush me (both nights ending up the angry horse went up in the air to get some more momentum) but the dreams changed before I knew if I got crushed or not. It's been a bit disturbing.\n\nEdit: sorry I meant STOMPED 😅",
    "images": []
  },
  {
    "title": "The Man with the Black Horse",
    "link": "https://old.reddit.com/r/Dreams/comments/1mailay/the_man_with_the_black_horse/",
    "body": "When I was a child—ten, maybe twelve—I used to dream of a man and a horse. He always came in black. The man wore a wide, shadowy hat, his face hidden in its fold. I never saw his mouth, nor his nose, only the faintest gleam of his eyes—like stars reflecting in a still lake. The horse, too, was black—tall, powerful, silent. Its eyes shimmered the same way. They never spoke, but they always watched. I never understood why I dreamed of them, only that I did, more often than felt normal. They never chased or haunted me. They simply were—appearing in the middle of nowhere, standing still, always in silence, like they knew something I didn’t. The dream I remember most began in the woods. We were on a picnic—or something like that. People were laughing, eating, moving around me. But then something happened. A noise, a rush, a blur of running feet. Panic. People scattered. I remember grabbing nothing, only running, my heart pounding. The trees swallowed everything. I was alone. And then they were there. The man and the horse stood in front of me, still as stone, as though they'd been waiting all along. The man reached into his coat and pulled out a small brown bag. It looked ordinary—leather, soft, worn—but it felt heavy when he handed it to me. I opened it. Coins. Old ones, maybe gold or bronze, I couldn't tell. They were cold. Important. I looked up to ask something—anything—but he was already turning. He and the horse walked away, quietly, calmly, their blackness folding into the woods like smoke. That was it. I woke up holding nothing, but it didn’t feel like nothing. Later—months or years, I don’t remember—I dreamed again. This time, the horse came alone. It stood in our backyard, its black coat shimmering in the night air. It didn’t move, just stared at me from the grass like it remembered me, like it was waiting. I didn’t go outside, but I stood by the window, watching it watch me. Far away, down the street or through some strange space in the air, the man was looking for the horse. But not frantically. He walked slowly, patiently, like he already knew where it was and just needed time to arrive. I don’t remember what happened after that. Maybe I woke up. Maybe the dream never needed an ending. All I know is, even now, years later, I sometimes wonder about the coins. And if that horse is still out there—watching. Waiting.",
    "images": []
  },
  {
    "title": "Dream: Riding a Horse",
    "link": "https://old.reddit.com/r/Dreams/comments/1m93u8m/dream_riding_a_horse/",
    "body": "I had a dream that I got married, and we rode on a brown horse with a black mane. I remember in the dream that someone tried to sabotage the wedding because my husband was too rich for me lol. What could this possibly mean?",
    "images": []
  },
  {
    "title": "Horse whose wife is a cat",
    "link": "https://old.reddit.com/r/Dreams/comments/1mizx8h/horse_whose_wife_is_a_cat/",
    "body": "I had the strangest dream.. I dreamt of a horse and cat. The cat is the wife of the horse.. I don't know if it makes any sense.. But in my dream it felt normal. The atmosphere in my dream was normal.. Nothing unpleasant.. It felt like every other normal day.. It felt like a normal pleasant day..\nAnd i suddenly got up from middle of dream.. I remember my dream it felt normal at first and then a tad bit different(all this happened within 30 seconds) so i immediately took my phone and noted down \"cat who is wife of horse\" and slept again..\nI forgot this ever happened after i woke up from sleep few hours later\nNow after 3 days when i was going through my phone and got across this note and I remembered this\nI just want to know what this means.. A cat and a horse who are wife and husbands\nI always think there is some deeper meaning for dreams",
    "images": []
  },
  {
    "title": "Dream about a horse/dragon combo game",
    "link": "https://old.reddit.com/r/Dreams/comments/1m110ce/dream_about_a_horsedragon_combo_game/",
    "body": "Just had this dream during a power nap, but basically you played as this mythical horse and could use stickers and stuff to decorate it and some people had gotten really creative with theirs and used stickers to make the unlockable wings look multicolored among other things. There were both public worlds and private worlds and in your private worlds other people's dragons could come and attack you and you could fight them off with your horse's magic attacks or even dragon magic that your horse could learn, and when the dragon's health was low enough it would run back to the other person's world for you to not only keep attacking that dragon and if you defeated the dragon you got a huge reward. It also allowed you to see other people's bases and how they decorated their private world. You also had an idle game menu where you could use coins to buy upgrades that would go towards generating more coins for you, and what the upgrades were for would depend on your horse's job/personality.",
    "images": []
  },
  {
    "title": "Had a dream about a roller skating horse. Was pretty cool to watch him groove.",
    "link": "https://old.reddit.com/r/Dreams/comments/neyz6a/had_a_dream_about_a_roller_skating_horse_was/",
    "body": "I had a dream that me and my buddies were leaning over the guard wall at a roller rink drinking beers and watching people groove. Having a good old time. Then I see a horse on the rink, and it’s wearing skates and roller dancing like those old dudes do. Even had a horse girl in full Texas getup on its back. It was amazing.\n\nI have no idea why I had this dream. I have not been roller skating since I was a young teenager, and I don’t know why the horse was there or why he was so good at roller skating.\n\nI commented this on a bigger thread about dreams and then figured I’d come here because it was a cool dream and thought you guys would like it. The horse seemed to be having a good time.",
    "images": [
      "images\\horse\\Had_a_dream_about_a_roller_skating_horse__Was_pret_0.jpg",
      "images\\horse\\Had_a_dream_about_a_roller_skating_horse__Was_pret_1.jpg"
    ]
  },
  {
    "title": "Had a dream about a horse with roller skates and a lot kissing with women strangers",
    "link": "https://old.reddit.com/r/Dreams/comments/1lxtve6/had_a_dream_about_a_horse_with_roller_skates_and/",
    "body": "I sat down with over 5 different women and kissed on sight. For whatever reason, we were close together, almost touching our faces when talking about random things. Most of the women liked it by accident and wanted more, the rest couldn't resist.\n\nAlso I saw a horse with roller skates. Trying to signal farmers passing by, I encountered Christian Horner who was just recently fired from F1, driving a trailer/bus and telling me it's normal.\n\nHelp me make sense of the 2nd part",
    "images": []
  },
  {
    "title": "I had a weird dream about getting a toupee and riding a horse",
    "link": "https://old.reddit.com/r/Dreams/comments/1lq3thn/i_had_a_weird_dream_about_getting_a_toupee_and/",
    "body": "I have a horrible hair line so I thought it was funny. When they put the wig on me I had all this great energy and I don't know why but this isn't the first time horses were in my dreams ( I'd never actually wear a wig)",
    "images": []
  },
  {
    "title": "Let Me Eat That Horse Egg’ – A Very Weird Dream",
    "link": "https://old.reddit.com/r/Dreams/comments/1m3rrzx/let_me_eat_that_horse_egg_a_very_weird_dream/",
    "body": "https://preview.redd.it/2nch5wrkrsdf1.png?width=1536&format=png&auto=webp&s=8f322a6cd7cbbd56f5dd11f8836b89dd832a87c8\n\nI was with my cousin, Izack, on the stairwell of my old school. It was an old, Victorian-style stairwell with a red carpet. The stairwell kept going up really high — way higher than it ever did in real life.\n\nThe grumpy teacher and head of the boarding house, Mrs. Sage, was there. She was sweeping the floor on the stairs and being really mean and rude to everyone, just like she used to be back in the day. I was walking up the stairwell, but she kept appearing on every landing, sweeping the floor, being mean, and shouting at me. I kept jumping over her or running past her, over and over again.\n\nEventually, she handed me the broom and told me to sweep up. I did — and I was sweeping up cooked eggs. Lots of them were scattered in the corners of the stairs. She wanted me to pick them all up and make scrambled eggs, so I did. I put them in a bowl and mashed them up with a fork. I ate some, but it tasted horrible.\n\nThen, I had to go through a door on the staircase — a door that doesn’t exist in real life. Through this door was a restaurant-style kitchen. There was a chef woman in there who looked at me and said, “Let me eat that horse egg.” I gave her the scrambled eggs. She ate them, and her face turned into a half-horse, half-human person. It was really creepy.\n\nThe scene changed, and I was exploring that same stairwell again, but it felt like a parallel universe version of it. Everything was abandoned, and the lighting was slightly darker. My cousin was with me again.\n\nI suddenly heard a door open downstairs. A big, life-sized, wooden, polished marionette puppet of an overweight woman started walking up the stairs. She had a short baller-style haircut and cheeks that sagged downward. She was wearing a black T-shirt and black trousers. She floated up into the air and slowly poked her head above the stair rail, staring at me and my cousin while slowly turning her head. It was so eerie.\n\nBehind me, on the wall, there was a Victorian grandfather wall clock. I moved the pendulum or something inside it, and it started to chime — and it made that same creepy grandfather clock sound from Stranger Things. Would like to know anyones thoughts on this weird dream. Also I made an Ai image of what the puppet woman looked like and it is such a close match to the dream that its so eerie to look at.",
    "images": []
  },
  {
    "title": "I had a dream of horses in school.",
    "link": "https://old.reddit.com/r/Dreams/comments/1m4aw60/i_had_a_dream_of_horses_in_school/",
    "body": "This was when I was in middle school. Two horses came from the student entrance of my school at night. I think they're partners they made their way steadily through the hallway and up the stairs untill they had reached the chemistry lab. In there was my teacher. She then grabbed a needle and gave them a shot. I don't understand the meaning of the horses, why they're a pair, why they needed a shot, what was I and my teacher doing after school hours. It is a mystery.",
    "images": []
  },
  {
    "title": "Horse Leeching",
    "link": "https://old.reddit.com/r/Dreams/comments/1kz0jje/horse_leeching/",
    "body": "Had this dream a while ago, and it’s probably one of the most bizarre dreams I’ve ever had.\n\nI was stuck in this world where the floor was covered with shallow waters, about up to my ankles, and it was really foggy. Scattered everywhere were these “horse leeching stations” and nothing else.\n\nHow it worked is that you’d stand at the station, pick up live leeches from the bucket (the bucket never ran out of leeches, just FYI), and stick them onto the horse in front of you. Yes, the horse was alive, and a I’m pretty sure also aware, but it didn’t seem concerned about anything. It just stood there, allowing you to stick leeches on it. If you wanted a fresh horse, you’d just pull the lever on the side and the conveyer belts would take the horse to who knows where, before then bringing in a new one.\n\nThat’s basically it. That was my dream. It was just me sticking leeches onto horses, occasionally roaming around, and then eventually waking up. It probably means nothing, but it was a pretty damn weird experience. Sometimes, I look back on this dream and wonder what the hell my brain is conjuring up whenever I’m asleep.",
    "images": [
      "images\\horse\\Horse_Leeching_0.jpg",
      "images\\horse\\Horse_Leeching_1.jpg"
    ]
  }
]