[
  {
    "title": "Here’s a scene from a dream where I saw an elephant eating planets from a planet tree.",
    "link": "https://old.reddit.com/r/Dreams/comments/j1yxw9/heres_a_scene_from_a_dream_where_i_saw_an/",
    "body": "I am 100% jealous of your dreams.",
    "images": []
  },
  {
    "title": "Meet Ruby the elephant. She has 24 legs and is really some kind of bug thing wearing an elephant costume.",
    "link": "https://old.reddit.com/r/Dreams/comments/mzzquj/meet_ruby_the_elephant_she_has_24_legs_and_is/",
    "body": "I don’t know why but I was compelled to count the legs to make sure there were 24. Also that is the most awesome nightmare fuel I’ve seen but I bet Ruby is probably a sweetheart so I won’t judge <3",
    "images": [
      "images\\elephant\\Meet_Ruby_the_elephant__She_has_24_legs_and_is_rea_0.jpg",
      "images\\elephant\\Meet_Ruby_the_elephant__She_has_24_legs_and_is_rea_1.jpg"
    ]
  },
  {
    "title": "I had a dream that featured a small family huddled in a dead, mechanical elephant turned guard tower, searching the surrounding woods for something. And I drew it.",
    "link": "https://old.reddit.com/r/Dreams/comments/c4ep61/i_had_a_dream_that_featured_a_small_family/",
    "body": "Fuck yeah that's why I joined this sub son.",
    "images": [
      "images\\elephant\\I_had_a_dream_that_featured_a_small_family_huddled_0.jpg",
      "images\\elephant\\I_had_a_dream_that_featured_a_small_family_huddled_1.jpg"
    ]
  },
  {
    "title": "I have been dreaming about chased by an Elephant for multiple times",
    "link": "https://old.reddit.com/r/Dreams/comments/1mjm1yf/i_have_been_dreaming_about_chased_by_an_elephant/",
    "body": "I have been chased by an elephant for multiple times in my dreams. Once my whole bloodline have been chased by an elephant.Today morning I have been chased again and all these dreams are very long and often occuring during my time of wakeup around 5:45 am and alarm is what making me waking up from this dream. I usually dream bad every single night.What to interpret here?",
    "images": []
  },
  {
    "title": "Two elephant",
    "link": "https://old.reddit.com/r/Dreams/comments/1n4tgke/two_elephant/",
    "body": "I dreamed that I was eating when suddenly there were two elephants on a coconut tree in front of the gate of my school, SMK Sura. One of the elephants fell. Then, suddenly, my friend, whom I call Chot, and I were in a dining hall for wealthy people—rich folks, national leaders, and others. We walked until we reached a screening room and sat down. Suddenly, a choir of kids from America started singing the school anthem of my school. At the back, there was a big screen showing chaos in front of the gate of SMK Sura—there was a helicopter crash, people were shooting at each other, and so on. Then it suddenly showed one year later, with many military vehicles at the municipality of Sura. Then I woke up.",
    "images": []
  },
  {
    "title": "Elephant dream",
    "link": "https://old.reddit.com/r/Dreams/comments/1n0xlmc/elephant_dream/",
    "body": "I had a dream last night where there was this elephant i was trying to chase. Each time i got close to it, it seemed to instantly get farther from me. I was really anxious at one point because i couldn't get to it, but eventually when it got super far away I calmed down and realized that it would come back to me once it finished its \"work.\" Any idea of what this could mean?",
    "images": []
  },
  {
    "title": "I dreamed about chased by Elephant once again",
    "link": "https://old.reddit.com/r/Dreams/comments/1mzfg7d/i_dreamed_about_chased_by_elephant_once_again/",
    "body": "I have chased by elephants n number of times and I have missed my count. I wrote here last time when I had a dream and again I have dreamed now but this time I was chased while I was riding motorcycle. Later the dream have shifted towards terrorist trying to kill me and my gang in a ship.Sometimes I was negotiating with them and sometimes I was fighting back but any way I was not getting killed in any of my dream.",
    "images": []
  },
  {
    "title": "\"Spoon elephant can't palpy\" (Bizzare dream)",
    "link": "https://old.reddit.com/r/Dreams/comments/1mls3gw/spoon_elephant_cant_palpy_bizzare_dream/",
    "body": "I dreamed I was sleeping in my parents' bedroom. I heard a loud THUMP, and I instinctively closed my eyes. But since this was in 3rd person, I still saw what caused the noise; A large, square cattle-like creature covered in brown shaggy fur. It broke down the door in one hit and forced itself into the bedroom. I just barely opened my eyes for a split second, and it started chasing me down a hallway.\n\nIt only lasted for a few seconds, because I was saved by a digital artist. She taught me a song, which, assuming that A is the lowest note, and E is the highest, went like so.\n\nA, E, C/A, C, E, D, B/A, C, E, D, B/A, C, E, D, B\n\n(Upon waking up, I realized how closely it resembles the intro song from Undertale)\n\nThen I saw I wasn't in my house, but a big classroom. The kids were working on projects of some kind. I leave the room for a bit. When I returned, the room was pitch black and I saw a girl just outside the door try to pick up a washer ring. Another girl said \"Don't touch that!\" and it started echoing throughout the room.\n\nHere's where the dream gets weird. The room lighted up, and the children were in cages, some stacked up to the ceiling. But they seemed sort of...chill? Like they weren't disturbed? At any rate, we unlocked the cages somehow, and we all walked downstairs into a large indoor convention.\n\nI walked around a bit, only to find that the video games they were selling were pirated or bootlegs. One had SpongeBob photoshopped on the cover with a speech bubble that said something in spanish. I got bored and felt a little insulted. As I was returning to the entrance, I saw a computer monitor playing the DK rap. Except the only words were \"Spoon elephant can't palpy\".\n\nThen I woke up, totally confused.",
    "images": []
  },
  {
    "title": "Dreamt I was an elephant otter alien nerd that figured out where souls were generated in the quantum field.... long story. Here’s what the creature looked like.",
    "link": "https://old.reddit.com/r/Dreams/comments/j0rwow/dreamt_i_was_an_elephant_otter_alien_nerd_that/",
    "body": "What kind of pen is that?",
    "images": []
  },
  {
    "title": "Dying elephant in dream",
    "link": "https://old.reddit.com/r/Dreams/comments/1l5ekwy/dying_elephant_in_dream/",
    "body": "I had a dream in which an elephant who was trying to save me and my family unfortunately got trapped and died infront of my eyes.I was trying to help him but it was kind of too late and he was crying and was looking into my eyes in pain.I tried to comfort him during his last minutes and promised he will come back again and meet me. This dream is very emotional and is in my head all day.Anybody knows the significance of this.",
    "images": []
  },
  {
    "title": "Dreamed I was gifted the building blocks of an Elephant Kaleidoscope",
    "link": "https://old.reddit.com/r/Dreams/comments/1lm53qv/dreamed_i_was_gifted_the_building_blocks_of_an/",
    "body": "I had this dream a few months back and it still sits with me. One of the shorter dreams I've had but I remember it clear as day.\n\nAll I could see were my hands, palm up, ready to receive a gift. A beautiful, wood colored, intricately carved tube was placed in my hand by...one. This \"one\" felt familiar, safe, loving, trustworthy, powerful, wise, but I never actually saw any feature of them. I can't explain how they put the tube in my palm without any hands or anything but they did. It just was.\n\nAn elephant head of the same color and markings was then placed in my palm. Without any words I understood that this \"one\" was showing me that the two pieces go together. I knew that I was being given a kaleidoscope. Then a magnificent, intricate ivory elephant head was placed in my palm. I instantly understood that I was meant to put the wooden kaleidoscope together and, when the time was right, replace the wooden elephant head with the ivory one.\n\nAs I looked up to thank this \"one\" for the gift I woke up, never seeing anything about the source of the gift.",
    "images": []
  },
  {
    "title": "Elephant in my dream",
    "link": "https://old.reddit.com/r/Dreams/comments/1lr7s1o/elephant_in_my_dream/",
    "body": "I had a dream years ago when I was younger about my bedroom door locking me in and a little red elephant would show up on the door knob, nowadays, those personality type quizzes have an elephant that looks shockingly similar. Any idea what the dream means and if there’s correlation? I’m probably just overthinking it",
    "images": []
  },
  {
    "title": "Had a dream last night about something I call \"The Suicide Elephant\"",
    "link": "https://old.reddit.com/r/Dreams/comments/1fr11f0/had_a_dream_last_night_about_something_i_call_the/",
    "body": "So in my backyard is an elephant. He is a perfectly sweet creature. But if you stand in front of this tree, he understands you want to die and he will charge at you, crushing you between himself and the tree.\n\nI stood in front of the tree and he crushed my right side. Breaking my arm in several places but i couldn't feel any pain. I felt calm and relaxed as he charged me again and killed me.\n\nBut of course, dream logic, i wake up somewhere else still alive. So i had to return to the suicide elephant to have him kill me again.\n\nIt was strangly peaceful and reassuring that this elephant would kill me so simply and painlessly.\n\nDreams are weird yo.",
    "images": []
  },
  {
    "title": "I had a dream about killing an elephant by accident, what does it mean?",
    "link": "https://old.reddit.com/r/Dreams/comments/1i7rysh/i_had_a_dream_about_killing_an_elephant_by/",
    "body": "In dream, there was an elephant near a tree, very close to that , I met a horse that I knew and feed him - then used the horse duck to mature the tree and then went on to climb the tree by stepping on the elephant but the elephant died when I step on it but I landed safely by holding on the tree branch. I was shocked and confused and called my father.",
    "images": []
  },
  {
    "title": "Dream Creature - \"Sharp-Toothed Elephant\"",
    "link": "https://old.reddit.com/r/Dreams/comments/1ii7aln/dream_creature_sharptoothed_elephant/",
    "body": "First Met: Est. 2012-2013\nOriginal Entry: Thy were these massive hairy things, looking almost like mammoths, only a lot more monstrous - with glowing eyes and pointed teeth. They had these dark deep voices as they conferred as to what to do with the baby. They passed it back and forth as they talked amongst each other.\n\nMy Art Website || Instagram",
    "images": [
      "images\\elephant\\Dream_Creature_-__Sharp-Toothed_Elephant__0.jpg",
      "images\\elephant\\Dream_Creature_-__Sharp-Toothed_Elephant__1.jpg"
    ]
  },
  {
    "title": "Recurring dream chased by a lion then elephant",
    "link": "https://old.reddit.com/r/Dreams/comments/1h5psd8/recurring_dream_chased_by_a_lion_then_elephant/",
    "body": "Been having a hard time sleeping lately and usually go to bed at around 3 or 4am. First dream I had was I was riding a jeep with my mom and sister then when I looked outside, a lion was chasing the jeep. When it finally caught us and almost got inside, I woke up.\n\nThe following dream, just 2 days apart. I slept at around 3:30am (looked at the time before putting my phone away). I had the same scenario again, but this time it's an elephant. I woke up again when it finally caught us. When I checked the time it's only 3:45am so in around 15mins I was able to dream all of it.\n\nMy Pluto is in Sagittarius in the 12th house and I tend to dream a lot and remember it vividly. This has been true since childhood wherein I dream for answers to my questions. Although for this particular scenario, I don't have any clue what it means.\n\n*photo created by chatgpt just to visualize it, but it was just me at the right side and my mom and sister at the left side",
    "images": [
      "images\\elephant\\Recurring_dream_chased_by_a_lion_then_elephant_0.jpg",
      "images\\elephant\\Recurring_dream_chased_by_a_lion_then_elephant_1.jpg"
    ]
  },
  {
    "title": "Dreamt about being tasked to take down an elephant in my garden",
    "link": "https://old.reddit.com/r/Dreams/comments/1hfwom8/dreamt_about_being_tasked_to_take_down_an/",
    "body": "It was quite cool and cinematic actually.\n\nI was in the kitchen with my dad when I saw a giant white elephant rampaging through the garden (the garden was not its normal size and was about the size of half a football pitch).\n\nHe gave me a bow and some arrows and I had this overwhelming urge to take down the beast. And so I charged out onto the grass and led behind a small bush (which barely covered even my head). My heart was racing at this point.\n\nBut then everything went calm and i didn’t want to hurt the elephant. I watched as it went into a small building out of sight. And that was the end of the dream.\n\nI have no idea why I dreamt something like this, nor what meaning I can glean from it. But it was awesome",
    "images": []
  },
  {
    "title": "Elephant eagle",
    "link": "https://old.reddit.com/r/Dreams/comments/1gm43sr/elephant_eagle/",
    "body": "Had a dream last night about an elephant eagle hybrid.",
    "images": [
      "images\\elephant\\Elephant_eagle_0.jpg",
      "images\\elephant\\Elephant_eagle_1.jpg",
      "images\\elephant\\Elephant_eagle_2.jpg",
      "images\\elephant\\Elephant_eagle_3.jpg"
    ]
  },
  {
    "title": "Elephant speaking in tongues",
    "link": "https://old.reddit.com/r/Dreams/comments/1gozdk0/elephant_speaking_in_tongues/",
    "body": "Had a dream I was at a christian camp and we were all running towards the river behind some trees but then loads of elephants started charging at us. I managed to dodge a few but then one was coming straight towards me. I put my hand out and it stopped and let me rest my hand on it. I then thanked it for stopping and blessed it in Jesus name and it said “I love you” then grew hands and started speaking in tongues and sign language.\n\nIntrigued, I followed it and brought it to the rest of the people there. That’s all I remember",
    "images": []
  },
  {
    "title": "Dream About a Protective Elephant –",
    "link": "https://old.reddit.com/r/Dreams/comments/1gy49cm/dream_about_a_protective_elephant/",
    "body": "I dreamt I was in my village with a majestic, intelligent elephant. It was highly protective of me, stepping in whenever it sensed danger. Adorned with ornaments, it felt almost human-like in understanding. I even had to reassure it that I wasn’t in danger.\n\nWhat could this mean? Anyone experienced something similar?",
    "images": []
  },
  {
    "title": "I had a dream last night about having to give vaccines to a middle eastern king's baby elephant.",
    "link": "https://old.reddit.com/r/Dreams/comments/1ghwizw/i_had_a_dream_last_night_about_having_to_give/",
    "body": "I've had plenty of work- related dreams in the past, but this one REALLY takes the cake. In my waking life, I'm a vet tech. I work in specialty now, so I don't normally give vaccines to patients, but I used to earlier in my career. The facility that I was working at, in this case, was completely unfamiliar and I did not know any of the people I was working with. I was told that this king wanted us to vaccinate his baby elephant and wanted to make a huge ceremony of it. We had our supplies ready to go, but they were insanely large and hard to handle. When the ceremony started, this king came around outside on an elephant with 2 other adult elephants and the baby striding behind him. They were not dressed ornately or anything, just bare. I came out and my boyfriend was the one restraining the elephant for me to poke (he works in IT, not with animals irl). The baby elephant was missing its trunk. When I tented the skin to start poking, it started thrashing and my boyfriend had to let it go. The doctor told the king that we would have to sedate it to do anything and the king seemed to understand, the ceremony portion was over anyway. Another coworker told me that I had the wrong syringe, away from this king, and that he had no idea what I was holding. I remember feeling disappointed in myself before I woke up. What do you guys think of this?",
    "images": []
  },
  {
    "title": "I my dream, I was Chased & Head butted by a black donkey and I did hold it tightly, and an elephant came & trying to attack me. What does it mean?",
    "link": "https://old.reddit.com/r/Dreams/comments/1gop37m/i_my_dream_i_was_chased_head_butted_by_a_black/",
    "body": ".",
    "images": []
  },
  {
    "title": "Last night I dreamed I was an elephant. Today, my dog died.",
    "link": "https://old.reddit.com/r/Dreams/comments/1fdubup/last_night_i_dreamed_i_was_an_elephant_today_my/",
    "body": "Last night I woke up from a nightmare where I was an elephant. There was a storm and this great big field of thorns was flooding. My baby elephant was stuck in the thorns. I tried to swim out and save him, but the current was too strong, and the thorns kept ripping up my body. I couldn't reach him, and I was drowning too. I couldn't help him.\n\nThis morning, my dog, just barely a senior at eight years old, died of a sudden heart attack. My baby.",
    "images": []
  },
  {
    "title": "Strange dream with an orca and elephant",
    "link": "https://old.reddit.com/r/Dreams/comments/1fkl43v/strange_dream_with_an_orca_and_elephant/",
    "body": "Good morning everyone! Before I will explain the dream I woke up from, I want to share some background info on why I am posting here. I usually don't remember dreaming. In my 38 years, I remember 3 dreams (including the one below). One was a bit scary from my early childhood when I was 5 years old. One from when I was 27 which oddly connected to something that happened several weeks afterwards and gave me an odd reassurance that I can achieve that certain goal, if I don't give up - which in the end, I was able to pull off, achieving one of my life long my dreams. I am not esotheric, I am a non believer of many things, but since that second dream, I was anticipating the next one. Now, 11 years later, I had the following dream and while I was immediately able to connect my second dream to my situation in life, this third one today leaves me utterly confused.\n\nI was recently in Honolulu and really liked the Waikiki beach. In my dream, I was swimming there with my family, very close to the shore, able to stand up to my breast. We had fun and were talking about how beautiful it is in Waikiki. Then, a big orca suddenly appeared in front of me and gently bumped its nose into my stretched out hand. I touched it and petted it, actually \"feeling\" its skin in my hands, a bit rubbery gummy like (Orcas are my favorite animals). I was excited and happy, as I always wanted to swim with one. Suddenly, something felt off and I was backing away backwards until I was out of the water. I was looking away and then back at the orca, who turned around bumbing into an elephant standing in the water. The orca started to bite into the side of the elephant and dragged it out into the ocean, while the elephant was mentally absent and just standing in the water. However, the bay was suddenly dammed off, the water drained and a crew of people got the elephant freed. The injured elephant walked back to the shore. The dam and people vanished, the water returned and the orca swam away.\n\nI would be curious about what you all think haha.",
    "images": []
  },
  {
    "title": "I dreamt that I was in a line of people and when it was my turn, a whale gifted me a baby elephant. What does it mean?",
    "link": "https://old.reddit.com/r/Dreams/comments/1eynxik/i_dreamt_that_i_was_in_a_line_of_people_and_when/",
    "body": "Everyone was waiting in line, and everyone received a tiny baby elephant from these whales in the water in front of us",
    "images": []
  }
]