[
  {
    "title": "I had a weird dream where I met God; he was a clay Lightning McQueen, and he bloomed out of a flower to talk to me.",
    "link": "https://old.reddit.com/r/Dreams/comments/m75vdp/i_had_a_weird_dream_where_i_met_god_he_was_a_clay/",
    "body": "Ka-Chow",
    "images": [
      "images\\flower\\I_had_a_weird_dream_where_I_met_God__he_was_a_clay_0.jpg",
      "images\\flower\\I_had_a_weird_dream_where_I_met_God__he_was_a_clay_1.jpg"
    ]
  },
  {
    "title": "Experiencing 15 years of life in 7 hours of sleep",
    "link": "https://old.reddit.com/r/Dreams/comments/1nczd1g/experiencing_15_years_of_life_in_7_hours_of_sleep/",
    "body": "A couple months of go I had a dream unlike any other. I experienced a whole separate life of 15 years in the matter of 7 hours of sleep. here’s the story:\n\nSo the day was just like any other day. I wasn’t overly tired or anything, I went to work normally and had the same evening routine and everything. Nothing felt out of the ordinary. I usually go to sleep around the same time every night and this wasn’t any different.\n\nNow I do want to preface by saying I’ve always had crazy dreams. I used to have a lot of dreams about dying and having terrible things happen to me, I’ve had lucid-like dreams, I’ve even had two occasions of what seems to be astral projection. My dreams have always been vivid or overly emotional or whatever so usually I’m not affected by these things.\n\nAnyways I go to bed that night and as I fall asleep, the “dream” starts. I come to in a bedroom. Now the first thing I remember feeling is a sense of confusion. It’s like when you walk into a room and forget what you went into the room for. It was only for a moment but as I looked down there’s my boyfriend in my lap looking up at me curiously. And as soon as we made eye contact, it was like everything just clicked. The confusion was gone and suddenly I was just aware of who I am and what’s going on.\n\nI wasn’t anyone different and the guy in my lap was my ex boyfriend from two years prior but in this dream we had never broken up. I also want to say after that initial moment of confusion there wasn’t anything else that ever alluded to me not being me. I accepted all that was around me. I had all these memories and experiences and I accepted it as fact.\n\nAlso usually when I’ve had dreaming experiences emotions and everything feel very vivid and hyper realistic and anytime I ever encountered pain or any physical contact in previous dreams it was like a phantom pain, like a dull not real pain. In this dream, everything was real. Every subtle emotion, every thought, every paper cut or bruise or touch, was real, I could actually feel it.\n\nAnyways, back to the experience. We’re just joking around and whatnot. Then he suddenly got serious and looked at me and said,”Let’s do this.” And I was like,”Do what?” And he nudges me and was all timid and said,”You know get married.” And I scolded him for being so nonchalant about asking me to marry him and whatnot. But in that moment the memories him and I had, some actual memories from when we were together in this reality and some that are from that dream world, and I said yes.\n\nAnd so my life continued in this world. I experienced every day fully. There were never gaps of time or whatnot, every day I fully lived. From Boring conversations at work, being stuck in traffic, meaningless arguments, etc to my wedding day, the birth of our child, funerals, birthdays, my child’s first steps and first day of school. All of it was continuous.\n\nAnd this is why it still affects me and I haven’t been able to get it out of my head. I feel this unimaginable grief and I have these insights that there’s no way I could know the feeling. Furthermore I have always had the fear that if I ever did have a kid, and I have already decided that if I did it would not be biologically mine, that I would never truly understand what it was like to create life and have that connection.\n\nBefore this, I have never been the most nurturing person, or even had the feeling of what parenthood feels like. Like the idea of kids was a far off idea that may or may not happen. But I remember the feeling of seeing my child for the first time. I remember something accustomed to a flower blooming inside of me. Knowing that the love I have for my child was unlike anything I’ve ever known. It was a love above anything else I have ever felt. It is an understanding unlike anything I’ve ever known.\n\nAnd I can’t stress this enough it has never made sense to me why to have children but in this dream it made sense. I can picture him at every stage in life. If I had any artistic talent I could draw sketches of him throughout him growing up. I spent all these years with people and experienced life with them. I learned things, grew, made new friends, experienced death of loved ones, etc.\n\nThen just a random day, I snap awake. Nothing to prepare me, or even know that this would come to an end. Just as quick as someone snapping their fingers, I lost it all. I woke up in my bed and shot straight up. Back into reality like coming up for air after holding your breath underwater.\n\nAnd then the grief set in. Everything hit me at once. I have never felt a sorrow like I have felt after waking up. I lost so much, a husband, memories, accolades, etc, but above all I lost my child. And that’s what hurts the most. I have this grief inside me for a life that isn’t mine. I have these years of growth and experiences and life that I can’t explain. And it makes me feel crazy and even more sad because I can’t even rationalize all of this myself.\n\nIt doesn’t make sense how I experienced that. I’m a pretty rational and scientific person and nothing I have come across or seen has given me any clarity or closure. If anyone has experienced this too please reach out. And while I can never fully articulate the detail and experiences of those years, I would think it would provide me with a lot of closure to find other people who’ve had the same experiences. Maybe I won’t get any answers to the questions and whatnot, I would at least get comfort.",
    "images": []
  },
  {
    "title": "I was going through a portal of flowers and dopamine?",
    "link": "https://old.reddit.com/r/Dreams/comments/1n6pev2/i_was_going_through_a_portal_of_flowers_and/",
    "body": "I tried to layer and edit some images to visualize what I was seeing. This is the closest to my visuals that I could create. I hope this is alright. (I do not own any of these images). First of all, I was not on drugs. I had this dream two different times. I was very, very sober for both of them, which makes this even weirder tbh.\n\nIn the dream, I would just zoom through portals whenever I closed my eyes, and they were beautiful portals with shades of magenta, blue, and purple. And there were visuals of beautiful flowers everywhere, mainly lilies. This portal did not have an end, but it felt so good? It felt like pure dopamine in my spine, like I was on narcotics or something. It was NOT in any way sexual either. I am asexual. This was nothing like that.\n\nIt also kind of felt like that adrenaline or stomach drop in your throat when you're on a roller coaster. It felt like I was falling, but it was a fun and peaceful fall. It felt so real though. It was so realistic that I thought I was awake and just doing this with my mind for fun. It was also in waves. I was opening and closing my eyes over and over until I woke up. It was genuinely so beautiful! This photo doesn't give it justice. It looked like I was swimming in a space in my mind or outside of it. I loved it, but it is still so odd to me that these dreams are even happening.\n\nI would love to know what you guys think of this! This stuff is so interesting to me.",
    "images": [
      "images\\flower\\I_was_going_through_a_portal_of_flowers_and_dopami_0.jpg",
      "images\\flower\\I_was_going_through_a_portal_of_flowers_and_dopami_1.jpg"
    ]
  },
  {
    "title": "Does anyone know this flower?",
    "link": "https://old.reddit.com/r/Dreams/comments/1n69qrx/does_anyone_know_this_flower/",
    "body": "I met him in a dream with a friend and I let him taste the nectar. He said it was bitter.",
    "images": [
      "images\\flower\\Does_anyone_know_this_flower__0.jpg",
      "images\\flower\\Does_anyone_know_this_flower__1.jpg"
    ]
  },
  {
    "title": "Dream of laying in flower petals?",
    "link": "https://old.reddit.com/r/Dreams/comments/1l90zqz/dream_of_laying_in_flower_petals/",
    "body": "I had a dream that there was a tree and it had flowers and they all fell off. And in the dream I was making snow angels in the flower petals in the grass. What could this mean?",
    "images": []
  },
  {
    "title": "Painted my dream. The day was wonderful. It was nice to enjoy the coolness of the forest, the smells of flowers and birch leaves, walking along a shady forest path.",
    "link": "https://old.reddit.com/r/Dreams/comments/vuovpo/painted_my_dream_the_day_was_wonderful_it_was/",
    "body": "That's a really good one.",
    "images": [
      "images\\flower\\Painted_my_dream__The_day_was_wonderful__It_was_ni_0.jpg",
      "images\\flower\\Painted_my_dream__The_day_was_wonderful__It_was_ni_1.jpg"
    ]
  },
  {
    "title": "I drew the effects of my dream on drinking passiflora flower tea before bed.",
    "link": "https://old.reddit.com/r/Dreams/comments/1nfxxhp/i_drew_the_effects_of_my_dream_on_drinking/",
    "body": "Visual effects during deep sleep and dream trips Let Art express the atmosphere of the situation instead of words.",
    "images": [
      "images\\flower\\I_drew_the_effects_of_my_dream_on_drinking_passifl_0.jpg",
      "images\\flower\\I_drew_the_effects_of_my_dream_on_drinking_passifl_1.jpg",
      "images\\flower\\I_drew_the_effects_of_my_dream_on_drinking_passifl_2.jpg",
      "images\\flower\\I_drew_the_effects_of_my_dream_on_drinking_passifl_3.jpg",
      "images\\flower\\I_drew_the_effects_of_my_dream_on_drinking_passifl_4.jpg",
      "images\\flower\\I_drew_the_effects_of_my_dream_on_drinking_passifl_5.jpg",
      "images\\flower\\I_drew_the_effects_of_my_dream_on_drinking_passifl_6.jpg",
      "images\\flower\\I_drew_the_effects_of_my_dream_on_drinking_passifl_7.jpg"
    ]
  },
  {
    "title": "Fairy ring of flowers",
    "link": "https://old.reddit.com/r/Dreams/comments/1nhex9h/fairy_ring_of_flowers/",
    "body": "It’s 2 am and I woke up from a dream because I was trying to figure out the meaning of my dream…in my dream.\n\nI can’t remember who was driving the car but I was riding past some land that belonged to my friend (in real life she does not own this land it was completely made up). One side was a graveyard with a tiny stone church that was old and no longer in use. On the other side was a garden that her mom loved and tended to, although they weren’t often “home”.\n\nI was completely amazed and a little uneasy, wondering what the meaning was when in the garden there was a fairy ring, but made of flowers. There was a single sunflower in the middle “separating” the circle that had beautiful blue and what flowers. I ran to my friend who was about to leave her house to travel back to her primary residence with her husband. I was explaining what I saw and she was also like that has to mean something.\n\nI went to my parent’s house (which somehow I was a teenager/college student again?). My mom had a ring of flowers on a plate but they were crocheted or a mix of materials and I was asking her what they were and what they meant. She was telling me and lavender came up. I also grabbed my phone and was looking up the names of the flowers with premonition and she got upset (as she is a “Christian”) I said I needed to know and that’s what made me wake up because I was like I need to know for real and you’re annoying me.\n\nI hope this makes sense, I literally woke up and was googling flowers and their meanings but I can’t figure out the fairy ring…",
    "images": []
  },
  {
    "title": "Archangel showing a dream about a woman \"concerning terrible importance, of flowers and brimstone\"",
    "link": "https://old.reddit.com/r/Dreams/comments/1n3gqia/archangel_showing_a_dream_about_a_woman/",
    "body": "I don't really remember the start, but I remember the archangel (I think Gabriel) and through a glass teardrop Gabriel showed me two outcomes, both regarding a woman \"concerning terrible importance, of flowers and brimstone\".\n\nI only remember her in an impressionist sense the way dreams are remembered: she had dark wavy hair and a tattoo on her collarbone.\n\nIn one part she was walking among towers wrapped in vines, solar panels along the streets and buildings, trees and flowers spilling onto the streets and turning them into rivers of green. She was playfully chasing a child through each each of the gardens, and I think they were wearing space suits or something? I think she was playfully chastising the girl about getting dirty. It ended with both of them watching a rocket-like thing that didn't leave a trail blasting/taking off.\n\nIn the other, she was tearing through a cave, and was walking toward a \"miracle-worker of machines\" which I think was like a technomancer dude with thick metal armor and a bionic eye or something. She was hunting him and a group of refugees. The technomancer was buying time and yelling at the people to run, thus facing her/trying to barricade her away with an energy barrier of some sort, the angel told me that he was fast, but she was faster and stronger/smarter or something. The group of refugees started running away from them while the technomancer dude went in for an attack or something and presumably died. He seemed kinda cocky lol.\n\nThoughts?",
    "images": []
  },
  {
    "title": "I knocked on a friend’a door to give her flowers but I accidentally ate them before she opened",
    "link": "https://old.reddit.com/r/Dreams/comments/ijwkgi/i_knocked_on_a_frienda_door_to_give_her_flowers/",
    "body": "I thought this was /r/stardewvalley for a second",
    "images": [
      "images\\flower\\I_knocked_on_a_friend_a_door_to_give_her_flowers_b_0.jpg",
      "images\\flower\\I_knocked_on_a_friend_a_door_to_give_her_flowers_b_1.jpg"
    ]
  },
  {
    "title": "Had a dream that a capybara was chasing me down my street and when I arriver home after locking the door, he put a flower on my porch",
    "link": "https://old.reddit.com/r/Dreams/comments/zvotug/had_a_dream_that_a_capybara_was_chasing_me_down/",
    "body": "I wanna have dreams like this",
    "images": [
      "images\\flower\\Had_a_dream_that_a_capybara_was_chasing_me_down_my_0.jpg",
      "images\\flower\\Had_a_dream_that_a_capybara_was_chasing_me_down_my_1.jpg"
    ]
  },
  {
    "title": "3D rendered animation of a sparkly flower I saw in a lucid dream yesterday!",
    "link": "https://old.reddit.com/r/Dreams/comments/i0kv4f/3d_rendered_animation_of_a_sparkly_flower_i_saw/",
    "body": "The way I would immediately pick it and face the consequences happily",
    "images": []
  },
  {
    "title": "Orange glowing flowers",
    "link": "https://old.reddit.com/r/Dreams/comments/1lhhbfs/orange_glowing_flowers/",
    "body": "I had the same dream a few days ago, this is the first time I’ve gone back to the same place in a dream.\n\nI was walking along a path through a forest, past the trees I could see peoples backyards like I was just outside of a neighborhood. I came across glowing orange flowers and felt an urge to rip them out and rub them on my skin and face. I followed the path into a clearing and saw a row of houses on a hill with their back half on stilts underneath them were planter boxes filled with these glowing flowers. I went to a box and got as many of the flowers as I could be for I heard the buzz of a drone creeping around. I tried to hide, but it found me. The drone shot me with something and I woke up shaking/twitching my body.\n\nI had a similar dream last week that also involved me finding a bunch of glowing orange flowers, hearing a drone, hiding, and getting shot, waking up to my whole body shaking",
    "images": []
  },
  {
    "title": "Getting flowers for a girl in a dream",
    "link": "https://old.reddit.com/r/Dreams/comments/1ldmmdb/getting_flowers_for_a_girl_in_a_dream/",
    "body": "I don’t know exactly where I was, but I held a door open for a random girl when I was walking into a building. After that she asked for my Instagram and I said sure. I was thinking to myself how this has never happened to me before, and I showed her my account.\n\nA bit later in the dream I was home, and I got a message from her. We were speaking over messages for a bit while I was sitting in my garden but unfortunately I don’t remember what we were saying. I turned off my phone and walked inside my house and pretty soon after that I woke up. Took me a few seconds to realise that none of it was real and I got pretty disappointed. Pretty soon after that I fell asleep again.\n\nOnce I had fallen asleep I had a continuation of the dream, but 2 days had passed. I looked at my messages and saw that she hadn’t responded to me in 2 days, but I saw that it was her birthday. I was in my back yard and saw these nice purple and pink flowers that were growing in the grass, they weren’t there in the dream before. I thought that for her birthday I would get her those flowers. I picked them and had them in my hand and I thought that they looked nice. Pretty soon after that I woke up again, and again I was disappointed to see that none of it was real again.\n\nNot really sure what to make of it, or why the dream continued once I had fallen asleep again",
    "images": []
  },
  {
    "title": "Painted my dream. The blooming meadow is like a fairyland full of blooming and beautiful flowers.",
    "link": "https://old.reddit.com/r/Dreams/comments/yo0z20/painted_my_dream_the_blooming_meadow_is_like_a/",
    "body": "I wish I had dreams more like this.",
    "images": [
      "images\\flower\\Painted_my_dream__The_blooming_meadow_is_like_a_fa_0.jpg",
      "images\\flower\\Painted_my_dream__The_blooming_meadow_is_like_a_fa_1.jpg"
    ]
  },
  {
    "title": "Recurring dream with the flower of life in intense red",
    "link": "https://old.reddit.com/r/Dreams/comments/1k98e17/recurring_dream_with_the_flower_of_life_in/",
    "body": "Hello everyone. Lately I've been having a recurring dream where I see an image that reminds me to the flower of life in a very intense, vibrant red color (with black background). The red seems to pulse and vibrate. The sensation is so intense that it gives me vertigo and fear, which causes me to wake up. Has anyone experienced something similar or have any idea what this might mean? Any comments would be greatly appreciated, as the recurrence and intensity of the dream have me quite intrigued.\n\nhttps://preview.redd.it/luzipjz5pexe1.png?width=848&format=png&auto=webp&s=bd9e72597c5123f0cd8384d3507e7838a23ebc69",
    "images": []
  },
  {
    "title": "Lost my voice and gained a pink flower",
    "link": "https://old.reddit.com/r/Dreams/comments/1kfcx9s/lost_my_voice_and_gained_a_pink_flower/",
    "body": "I don't often have dreams that impact me the next day, but this dream I had last night truly has me feeling some type of way still this morning.\n\nLast night I had difficulty falling asleep, which rarely happens for me. When I finally fell asleep, I woke up in a dream. I sat up, and exited the bedroom. I was not in my house, but i do feel like the house I was in was familiar, possibly one of my friends houses from high school. When I walk into the living room, all the lights are on and I begin to feel sick. There is a stairwell in front of the kitchen/dining area. Suddenly from the stairwell I see two shadowy figures, one standing, one sort of crawling, but not in a super freaky way, almost looked natural; the movement was very fluid and kind of reminded me of a cat. It is difficult to describe. Suddenly I find myself telling them to leave in the name of God. I'm not overly religious but I would say I'm spiritual and believe. My dream self was internally shocked I began saying this. The figures didn't come closer but did kind of shift around, and then two more who were standing also entered the stairwell from upstairs and \"got comfortable\" I would say, as one sat on a step and the other stood against the wall casually. After the third time I asked them to leave my voice is taken from me, and I cannot speak to ask them to leave. I begin pacing the living room, stressed and trying to speak. Occasionally, I am able to begin to speak, such as \"I...\" before my voice is gone again. This seemed to be humorous to them, as they were just shadows but I felt like I was being laughed at. I walk away and enter the bedroom and try to wake up my fiancé so he can tell them to leave as well and that they aren't welcome, since I can't talk to tell them myself. He wakes up briefly, and when I try to tell him what is going on, I still cant speak. Since I'm not speaking to tell him what's going on, he tells me to get some sleep and he goes back to bed. This frustrated me so I walk back out to the living room and begin to speak in my mind. Almost like panicked and rapid speech, it was something similar to \"Please fucking leave I don't want you here you are not welcome in this house near myself or my family gtfo in the name of God exit this house now\". Once I began to do this I felt a very strange feeling, still slightly sick but very uneasy. I stood my ground and then after they shifted around, almost as if they had looked at each other, the one who had been seated stood up. As soon as it stood i found myself saying \"ok fuck this. Get out my house , leave my family alone, I'm not doing this, especially not at this hour.\" Thinking about that line now makes me laugh now, but in the dream I was just feeling so over it and drained. My voice had returned for me to say that. I turned on my heel and walked back to the bedroom, where my kids were now in my bed when they hadn't been before. I held them and my fiancé and was praying over them with my eyes closed. I heard a door open and shut three times, and then heard my bedroom door shut, and then the front door open and shut. When I woke up this morning, I felt extremely exhausted, mentally and physically drained, sick to my stomach, and found a small pink plastic flower on my carpet by my bedroom door. My throat was also scratchy and quiet, lol.\n\nI'm unsettled, lol. Not that it was extremely scary, but it was highly stressful and just freaky. The feelings were very intense. And this mornings pink flower? I almost just went back to bed. Any thoughts on this? I'd love to hear what you think. I don't dream often and haven't had a dream that made me feel some type of way for years.",
    "images": []
  },
  {
    "title": "Flowers growing out of my arm?",
    "link": "https://old.reddit.com/r/Dreams/comments/1jnk5sk/flowers_growing_out_of_my_arm/",
    "body": "Yeah, so, I have no idea what this dream might mean. I have a condition called dermatillomania, and basically, I compulsively pick at my skin (primarily my arms). This has resulted in hundreds of scars all over my arms and dozens of current scabs. Last night I had a dream that flowers were growing out of my scars and scabs, and I started to pick at them. I think I ate a couple at some point? But the flowers kept growing back and I started to get frustrated. Eventually I woke up with no real conclusion to the dream. Not really sure what to make of it.",
    "images": []
  },
  {
    "title": "Paper flowers and a truck ride with 'boyfriend'",
    "link": "https://old.reddit.com/r/Dreams/comments/1k1p809/paper_flowers_and_a_truck_ride_with_boyfriend/",
    "body": "Hi everyone, I had a vivid dream last night, and would love your help interpreting it!\n\nIn the dream, I met a man—a very handsome guy of average height—who gave me a handmade bouquet of paper flowers. He told me he made it himself. The bouquet had three different flowers in it:\n\nA yellow flower with big petals.\nA purple and white shaped like a ball, this was my favourite and my attention was mainly focused on this.\nI can’t remember the third one.\n\nReceiving the bouquet made me really happy. Then he introduced me to his friends and said, “She is my girlfriend since this Tuesday.”\n\nThe next scene jumped to the two of us in the back of a truck, lying close to each other. He placed his hand on my chest , and I then moved his hand inside my t-shirt. That’s where the dream ended. I felt really happy and valued and overall an ecstasy like feeling.\n\nHere’s the thing—I already have a boyfriend in real life. When I woke up and realized what I had dreamed, I felt really guilty and uneasy. I don’t recognize the guy from the dream, and I don’t know why I would dream about being so close with someone else.\n\nAny thoughts on what this might mean? I’d really appreciate your insights!",
    "images": []
  },
  {
    "title": "This flower appears in my dreams lately",
    "link": "https://old.reddit.com/r/Dreams/comments/1hipbm3/this_flower_appears_in_my_dreams_lately/",
    "body": "Coxcomb",
    "images": [
      "images\\flower\\This_flower_appears_in_my_dreams_lately_0.jpg",
      "images\\flower\\This_flower_appears_in_my_dreams_lately_1.jpg"
    ]
  },
  {
    "title": "Tooth growing like a flower in my mouth",
    "link": "https://old.reddit.com/r/Dreams/comments/1ix2z47/tooth_growing_like_a_flower_in_my_mouth/",
    "body": "Last night, I dreamt that there was an extra molar growing in the back, bottom, right side of my mouth. I could feel it with my tongue, and when I opened my mouth to see it, it… sprouted?… like a bud on a flower. I could see the tooth growing inside the bud. And it was all soft and the color of my mouth, but the tooth was hard and white. I wasn’t upset about it, but I knew it was going to mess up the rest of my teeth, so I went to the dentist to have it removed. I called my mom (but I can’t remember if it was my mom or my stepmom) to tell her what was happening. When the dentist showed up, he was wearing a wig, poorly and, instead of removing my tooth, we had a conversation about his wig and how to wear it properly. (I’ve never worn a wig…) This is one of those dreams that I didn’t remember when I first woke up. It just suddenly came to me. “I was growing an extra tooth…” Enjoy my artistic abilities.",
    "images": [
      "images\\flower\\Tooth_growing_like_a_flower_in_my_mouth_0.jpg",
      "images\\flower\\Tooth_growing_like_a_flower_in_my_mouth_1.jpg"
    ]
  },
  {
    "title": "I dreamt about dying in a flower field",
    "link": "https://old.reddit.com/r/Dreams/comments/1j1p114/i_dreamt_about_dying_in_a_flower_field/",
    "body": "Hello, well its as the title said\n\nToday i had a dream that first started in some kinda big mall but i cant remember that part too well\n\nI remember though it had this open art gallery and there was a statue of a man posing, i came to closer to take a better look but it turned out it was an alive man\n\nIt spooked me and i jokingly told him \"this statue is little bit too realistic for me\" and he smiled at that\n\nTbh he was kinda handsome, i remember he had blonde hair\n\nWell then my dream changed, and i found myself in beautiful fields of flowers in some kinda grove, they were fields devided by colour, so violet, yellow,this pale beige, those are the colours i remember most\n\nThem my mom appeard, and she said to me that shes dying, and is going to choose her resting place now, she was slowly looking around till she fell on the pale beige flower field\n\nAnd then it was my turn, i was gonna die too, i felt defeated and exhausted, but i pushed myself to look around where should i die\n\nI fell on the violet flower field, but barerly, i mean as in few centimeters down and id be between violet and the yellow flower field\n\nAnd then i died\n\nIt was weird a one for sure, honestly i wanna ask if this has any meaning",
    "images": []
  },
  {
    "title": "I have visions of plants, with shining flowers and leaves. What does it mean.",
    "link": "https://old.reddit.com/r/Dreams/comments/1ijiwj3/i_have_visions_of_plants_with_shining_flowers_and/",
    "body": "Last night I woke up as I heard my son sleep talk again. When I woke I literrally saw plants floating about where my hubby is and my kids the leaves are shining and so the tiny flowers. I cannot believe as to what I am seeing so I tried to touch it. But it just smudge like a tiny particles of glowing sands.\n\nI open and close my eyes it was there until it disappear. I sat up to see clearly if my kids was okay. My husband wake up and asked me what is wrong. I just said I hear our kids sleep talking again. Then we fall back to sleep. I wake up again and there it was again. I immediately get my phone as I wanted to capture a picture of it but it was gone the moment my screen lit up. We sleep with no lights on. That is why I can see it clearly since the plant was shining. When I close the phone it shows again i tried to capture it but the room was dark and the camera dont capture anything but black. I just shrugged since it was gone again. Then at 4am when I woke up it was floating infront of me. And disappear again as lights from a passing vehicle shines the window. What the hell is that? I know I am not dreaming, so what does it meant?",
    "images": []
  },
  {
    "title": "I was allowed to enter an underwater forest of flowers 💐",
    "link": "https://old.reddit.com/r/Dreams/comments/1icbgxl/i_was_allowed_to_enter_an_underwater_forest_of/",
    "body": "It was so amazing. I was only allowed to enter because I am getting married and we were able to get married there. My fiancé wasn’t interested and I went to see it anyway. I remember being very frustrated with him just like in real life lol. Later in the dream we were with a group of people that took 2 octopuses out of the water and brought them to this high up diving board type structure. They jumped in and the octopuses were angry and went after them. I just remember feeling so mad they were disrupting the octopus. Such an amazing dream and so happy I remembered it.",
    "images": [
      "images\\flower\\I_was_allowed_to_enter_an_underwater_forest_of_flo_0.jpg",
      "images\\flower\\I_was_allowed_to_enter_an_underwater_forest_of_flo_1.jpg"
    ]
  },
  {
    "title": "Repeating dream of small white flowers growing on my tongue",
    "link": "https://old.reddit.com/r/Dreams/comments/1gzzfhl/repeating_dream_of_small_white_flowers_growing_on/",
    "body": "I don't remember much of the dream before this point, but its been a repetitive theme that at some point in the dream I will go into the bathroom stick out my tongue in the mirror and very quickly these small white flowers will bloom from my tongue, there are a few about 4-5. super small white flowers kinda like the ones you see in your yard. I would look at them be slightly uncomfortable then go to try to remove them only to find that its impossible cause its deeply imbedded in my tongue. the most I can manage is damaging a few petals but even the petals are pretty hearty. Note im not in pain or anything in the dream. but its happen a few times now im wondering if there is any meanings.",
    "images": []
  }
]