[
  {
    "title": "I dreamed my cat had to be surgically turned into a ray",
    "link": "https://old.reddit.com/r/Dreams/comments/1mupk3b/i_dreamed_my_cat_had_to_be_surgically_turned_into/",
    "body": "I don't remember the reason tho lol Bur this is a pic of how i remember it Also it was flying in the air",
    "images": [
      "images\\cat\\I_dreamed_my_cat_had_to_be_surgically_turned_into__0.jpg",
      "images\\cat\\I_dreamed_my_cat_had_to_be_surgically_turned_into__1.jpg"
    ]
  },
  {
    "title": "I have vivid dreams. I miss my cat...",
    "link": "https://old.reddit.com/r/Dreams/comments/1nimxfk/i_have_vivid_dreams_i_miss_my_cat/",
    "body": "Months ago, I dreamed I had a kitten named Glumbo. Little guy was my world. Nothing happened to him in my dream. I just woke up to the realization he wasn't real. It actually broke me for a few weeks. My bf told me to draw him to cope. This is Glumbo- he was orange and crunchy. I still think about him.",
    "images": [
      "images\\cat\\I_have_vivid_dreams__I_miss_my_cat____0.jpg",
      "images\\cat\\I_have_vivid_dreams__I_miss_my_cat____1.jpg"
    ]
  },
  {
    "title": "Dreamt my childhood cat was alive again... Sorta",
    "link": "https://old.reddit.com/r/Dreams/comments/1jld6dn/dreamt_my_childhood_cat_was_alive_again_sorta/",
    "body": "Not really sure how to label this one exactly but it was neither short nor super long. I wouldn't really call it a nightmare either, it was both so sad and so pleasant, and just so incredibly upsetting.... I woke up sobbing from it, sobbing in the dream and now just woke up in the same exact state.\n\nIt started out with a visit to my grandma's, pretty far off in the countryside, so nothing new really reaches her, just like in real life. Well, I visit and stay the night, and she tells me she has something she's been waiting to show me. In my dream, there is this new AI hologram technology or something, some newfangled internet thing that can materialize somehow. Nothing new ever reaches grandma, so this should be good.\n\nAnd that's when my childhood cat jumps up on my chest while I'm laying down in bed. I can pet her, she feels just how I remember her, soft with her old bones underneath her skin, eyes doe-y for me, and she's acting just as excited to see me as I am, as if I had left on vacation for the week and now, I'm home, and she is so relieved to have me home. Of course, I'm rejoicing in my dream! I can't believe I get what feels like a 2nd chance at our ending, I get to pet her again and yammer and sing at her just like we always used to. Touching her fur again, scratching her head and avoiding her moles that she always had, all the special little things about her flowing back.\n\nWell, a few hours pass, and I'm reveling in it still, grandma decides to head to bed, and that's when it hits me, that this will come to an end. My parents will come to pick me up eventually, to take me back home, or a storm will come through and knock out the internet, or they'll do maintenance, and the internet will be out for as long as they are making repairs, or the bill gets missed somehow.... And that's when it becomes so overwhelmingly upsetting, that this will end. That she isn't actually here, that while this tech is really good at mimicking her, it isn't really her, and the real her is still in her tiny urn at home.\n\nShe's lying on my chest as I start weeping in my dream, and eventually I wake up from squeezing my eyes. And what sucks about this, is that I guess I had this dream because it was her first-year anniversary since she died yesterday, March 26th, 2024. And I'll never get to touch her again, not in a way that was similar to how she lived. I am 22, and she lived to be 21. My sunflower, my Sassy. I wish I could have stayed in that dream forever, honestly.",
    "images": [
      "images\\cat\\Dreamt_my_childhood_cat_was_alive_again____Sorta_0.jpg",
      "images\\cat\\Dreamt_my_childhood_cat_was_alive_again____Sorta_1.jpg"
    ]
  },
  {
    "title": "My sister's cat had threaded himself through the plugs of a power strip in the dream I had this morning.",
    "link": "https://old.reddit.com/r/Dreams/comments/1fegzyx/my_sisters_cat_had_threaded_himself_through_the/",
    "body": "The imagery was so absurd that I had to recreate it. In the dream, I found him chilling like this, completely unbothered. I think I had forgotten how electricity worked, because I couldn't figure out why seeing him like this freaked me out. His name is Peach (he is real).",
    "images": [
      "images\\cat\\My_sister_s_cat_had_threaded_himself_through_the_p_0.jpg",
      "images\\cat\\My_sister_s_cat_had_threaded_himself_through_the_p_1.jpg"
    ]
  },
  {
    "title": "This interesting looking character and his crab-cat that dominated my dream earlier.",
    "link": "https://old.reddit.com/r/Dreams/comments/sfl2l0/this_interesting_looking_character_and_his/",
    "body": "The crab-cat is the cutest spooky thing I've ever seen",
    "images": [
      "images\\cat\\This_interesting_looking_character_and_his_crab-ca_0.jpg",
      "images\\cat\\This_interesting_looking_character_and_his_crab-ca_1.jpg",
      "images\\cat\\This_interesting_looking_character_and_his_crab-ca_2.jpg"
    ]
  },
  {
    "title": "Dream of taking myself and my ugly cat away from this place. We wait at the bus stop. [OC]",
    "link": "https://old.reddit.com/r/Dreams/comments/oypoef/dream_of_taking_myself_and_my_ugly_cat_away_from/",
    "body": "Woah I love your art.",
    "images": [
      "images\\cat\\Dream_of_taking_myself_and_my_ugly_cat_away_from_t_0.jpg",
      "images\\cat\\Dream_of_taking_myself_and_my_ugly_cat_away_from_t_1.jpg"
    ]
  },
  {
    "title": "Hsd a nightmare that my cat had this fucked up humanesque face so I recreated it",
    "link": "https://old.reddit.com/r/Dreams/comments/1k06thq/hsd_a_nightmare_that_my_cat_had_this_fucked_up/",
    "body": "My girlfriend witnessed me waking up screaming/breathing",
    "images": [
      "images\\cat\\Hsd_a_nightmare_that_my_cat_had_this_fucked_up_hum_0.jpg",
      "images\\cat\\Hsd_a_nightmare_that_my_cat_had_this_fucked_up_hum_1.jpg"
    ]
  },
  {
    "title": "Had A Dream Someone Dug Up My Dead Cat And Turned It Into A Stuffed Cat Hand Puppet And Was Chasing Me With It",
    "link": "https://old.reddit.com/r/Dreams/comments/1egzlzu/had_a_dream_someone_dug_up_my_dead_cat_and_turned/",
    "body": "I was hiding in a bedroom from it and trying to keep the door shut as the puppet of my dead cat was looking throwing the side of the door and scaring me and the person who was controlling the puppet was laughing at my misery",
    "images": [
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__0.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__1.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__2.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__3.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__4.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__5.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__6.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__7.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__8.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__9.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__10.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__11.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__12.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__13.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__14.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__15.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__16.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__17.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__18.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__19.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__20.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__21.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__22.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__23.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__24.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__25.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__26.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__27.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__28.jpg",
      "images\\cat\\Had_A_Dream_Someone_Dug_Up_My_Dead_Cat_And_Turned__29.jpg"
    ]
  },
  {
    "title": "i keep having the same dream about this dude and his cat for a year and a half now, so i draw them (feel free to ask whatever)",
    "link": "https://old.reddit.com/r/Dreams/comments/z5tz0v/i_keep_having_the_same_dream_about_this_dude_and/",
    "body": "He looks like Shane from stardew valley",
    "images": [
      "images\\cat\\i_keep_having_the_same_dream_about_this_dude_and_h_0.jpg",
      "images\\cat\\i_keep_having_the_same_dream_about_this_dude_and_h_1.jpg"
    ]
  },
  {
    "title": "I dreamed that there were cats on top of every utility pole",
    "link": "https://old.reddit.com/r/Dreams/comments/103vg21/i_dreamed_that_there_were_cats_on_top_of_every/",
    "body": "Are you sure that was a dream?",
    "images": [
      "images\\cat\\I_dreamed_that_there_were_cats_on_top_of_every_uti_0.jpg",
      "images\\cat\\I_dreamed_that_there_were_cats_on_top_of_every_uti_1.jpg"
    ]
  },
  {
    "title": "I dreamed my cat was turning purple",
    "link": "https://old.reddit.com/r/Dreams/comments/1nggq86/i_dreamed_my_cat_was_turning_purple/",
    "body": "Cute little weird dream! Usually my dreams are super odd. And I guess you would consider this is odd, but it was so cute! I had a dream I went to a wedding I was invited to, no idea who’s wedding but everyone kept confusing me as a bridesmaid so I left because I was anxious, and I came home and my cat had natural purple splotches all over her! And she had a twin sister the same way. Not like how something would stain hair (or I guess fur in her case) but as if her hair was growing in purple! And it was SO vibrant! Anyway, my synopsis on why this dream occurred is, my cat gives me stress relief (best ESA ever btw) and her “aura” is purple. Does anyone have any theories or input as to why I had this dream? I’d love to hear about it!",
    "images": [
      "images\\cat\\I_dreamed_my_cat_was_turning_purple_0.jpg",
      "images\\cat\\I_dreamed_my_cat_was_turning_purple_1.jpg"
    ]
  },
  {
    "title": "Hi, I'm a crosshatch illustrator, it's not easy to express... But many of my illustrations take roots in my dreams. It's not rare that I dream of cats doing strange things. Am I crazy or something?",
    "link": "https://old.reddit.com/r/Dreams/comments/s8kxyo/hi_im_a_crosshatch_illustrator_its_not_easy_to/",
    "body": "Holy shit you’re good. crazy no, but brilliant maybe",
    "images": [
      "images\\cat\\Hi__I_m_a_crosshatch_illustrator__it_s_not_easy_to_0.jpg",
      "images\\cat\\Hi__I_m_a_crosshatch_illustrator__it_s_not_easy_to_1.jpg",
      "images\\cat\\Hi__I_m_a_crosshatch_illustrator__it_s_not_easy_to_2.jpg",
      "images\\cat\\Hi__I_m_a_crosshatch_illustrator__it_s_not_easy_to_3.jpg",
      "images\\cat\\Hi__I_m_a_crosshatch_illustrator__it_s_not_easy_to_4.jpg",
      "images\\cat\\Hi__I_m_a_crosshatch_illustrator__it_s_not_easy_to_5.jpg",
      "images\\cat\\Hi__I_m_a_crosshatch_illustrator__it_s_not_easy_to_6.jpg",
      "images\\cat\\Hi__I_m_a_crosshatch_illustrator__it_s_not_easy_to_7.jpg",
      "images\\cat\\Hi__I_m_a_crosshatch_illustrator__it_s_not_easy_to_8.jpg",
      "images\\cat\\Hi__I_m_a_crosshatch_illustrator__it_s_not_easy_to_9.jpg",
      "images\\cat\\Hi__I_m_a_crosshatch_illustrator__it_s_not_easy_to_10.jpg",
      "images\\cat\\Hi__I_m_a_crosshatch_illustrator__it_s_not_easy_to_11.jpg"
    ]
  },
  {
    "title": "Keep dreaming about my dead cat.",
    "link": "https://old.reddit.com/r/Dreams/comments/1ngis2g/keep_dreaming_about_my_dead_cat/",
    "body": "He passed away less than 4 days ago now. I don't remember all of them, just the first one. (I talked about this on the subreddit for pet loss too, so it might seem familiar if you've seen that one).\n\nI dreamed that I was holding and crying over him and my breath in his ear made him flinch and wake up. It was so vivid. I could feel everything; his ears twitching, his beautiful green eyes opening, the muscles in his body starting to stir. His fur was still so soft.\n\nThen I woke up and cried because he was gone again.\n\nI'd like to think that I keep dreaming about him because he's still hanging around.",
    "images": []
  },
  {
    "title": "Had a dream where one of my friends was an anthropomorphic cat similar to the one in the picture. He was a human cursed to be a cat and the people in my dream called the curse ‘Felineism’. He got cured at the end of the dream.",
    "link": "https://old.reddit.com/r/Dreams/comments/uoxxmo/had_a_dream_where_one_of_my_friends_was_an/",
    "body": "You mean blessed with being a cat?",
    "images": [
      "images\\cat\\Had_a_dream_where_one_of_my_friends_was_an_anthrop_0.jpg",
      "images\\cat\\Had_a_dream_where_one_of_my_friends_was_an_anthrop_1.jpg"
    ]
  },
  {
    "title": "Dreaming about an orange cat",
    "link": "https://old.reddit.com/r/Dreams/comments/1lciq06/dreaming_about_an_orange_cat/",
    "body": "I had a dream about a baby orange cat with black ears and it smelled like sulfur and it was really strong. The cat was scared of me at first and I had to wait for it to come to me and afterwards it was super sweet and that’s when I smelled the sulfur on it. Does anyone know what that means the cat was a dark orange and the ears were almost round with a nice pointy tip and pitch black and green eyes.",
    "images": []
  },
  {
    "title": "Petted my cat and snuggled with her purring in my ear last night- she died a few years ago.",
    "link": "https://old.reddit.com/r/Dreams/comments/1hpptjs/petted_my_cat_and_snuggled_with_her_purring_in_my/",
    "body": "For the longest time, she never came thru. I wondered how she was doing, but lately the past year or so, she has randomly a couple few times, snuggled with me in bed. Last night was the first time I was able to touch her and pet her. I was hesitant to touch her, but so relieved when I finally did and interacted with her. It always starts out the same, these random visits, I will be very aware of her cuddling next to me, jumping over my head, purring in my ear, etc. I will sleepily smile and join her, then slowly realize she passed.\n\nLast night was especially odd, because it was the first time that I looked into her eyes. I sleepily stared at her face, and asked her out loud, if God was real, if she knew God ( because I knew she passed away). Her eyes widened a bit when I asked her this, as if she were surprised. I must have woke up, because that is all I remember. These dreams are so vivid, they seem so real. I do believe she is visiting me in spirit. I am going thru a difficult, sad time in my life right now. I find these visits oddly comforting.",
    "images": []
  },
  {
    "title": "My cat turns into a monster and kills my friends. I calmly call the vet.",
    "link": "https://old.reddit.com/r/Dreams/comments/kmkfy4/my_cat_turns_into_a_monster_and_kills_my_friends/",
    "body": "This is the plot of The Owl House",
    "images": [
      "images\\cat\\My_cat_turns_into_a_monster_and_kills_my_friends___0.jpg",
      "images\\cat\\My_cat_turns_into_a_monster_and_kills_my_friends___1.jpg"
    ]
  },
  {
    "title": "I had dream about cat with each eye have two irises.",
    "link": "https://old.reddit.com/r/Dreams/comments/1jj3n1l/i_had_dream_about_cat_with_each_eye_have_two/",
    "body": "Sorry for my bad drawing it looked like the one I found online but actual cat with cat eyes not humans.\n\nI had dream about colorful cat with four eye pupils each eye had two idk what it means the only thing I found online is cat with four eyes:\n\nhttps://spiritualgleam.com/four-eyed-cat-spiritual-meaning/\n\nIt was like I know the cat or the cat was mine I hugged the cat and scratched his head and I woke up\n\nIdk how feel about am confused like should I feel scared sad happy angry shocked etc\n\nI talk to nobody about idk what it means internet didn’t helped me either do someone know one or two things about these dream",
    "images": [
      "images\\cat\\I_had_dream_about_cat_with_each_eye_have_two_irise_0.jpg",
      "images\\cat\\I_had_dream_about_cat_with_each_eye_have_two_irise_1.jpg"
    ]
  },
  {
    "title": "I had a dream I had retractable cat claws instead of leghair",
    "link": "https://old.reddit.com/r/Dreams/comments/1nkx6pi/i_had_a_dream_i_had_retractable_cat_claws_instead/",
    "body": "the claws were like going in and out like a pufferfish",
    "images": []
  },
  {
    "title": "Cats drinking too much tea",
    "link": "https://old.reddit.com/r/Dreams/comments/1hzsgn4/cats_drinking_too_much_tea/",
    "body": "In my fream cats were dying from drinking too much tea. It had become a big trend where people were giving their cats excessive amounts of tea, and the news was covering the problem because it was so bad and the cats were exploding from being so bloated\n\nAt one point I got into an argument with someone that posted a pic of their fat grey cat drinking tea with the caption saying “I don’t care what lies the news is spreading. MY CAT LOVES HIS TEA!” I commented saying “Dude it’s really dangerous to give your cat so much tea. He could die from it” and they responded with something like “How does that even make sense? He is thirsty and hmmm look at that look down he now has a belly full of tea thirst quenched. It’s healthy and good he is happy\" I was getting frustrated and replied saying “No u don’t understand. Haven’t you seen the reports? Cats are literally exploding from drinking too much tea. You have to stop, it’s making them too fat, and they are dying. You are a bad owner\"\n\nThen the dream ended. Nothing very interesting but that's the first dream I've had in a while and I woke up feeling more tired than I was before going to bed last night lol",
    "images": []
  },
  {
    "title": "Dreamed that I was in bed sleeping and a black cat 🐈‍⬛️ came to me",
    "link": "https://old.reddit.com/r/Dreams/comments/1nluocr/dreamed_that_i_was_in_bed_sleeping_and_a_black/",
    "body": "I just woke up from the weirdest most vivid dream just now. I remember watching a Facebook video a while back where they show you how to communicate with cats, basically how to call a cat to you. You say \"mah-ah\" to call one, and the cat will come when called. Weird, I know. I don't have cats, so I have never tested this out.\n\nAnyways, I was dreaming that I was in bed sleeping, and I called out \"mah-ah\" in my head. Then I heard and felt this gentle deep purring literally seconds after that, coming from next to me. There was a black cat cuddling up to my chest purring. It may have been a different color, idk... its just dark in my room and so I assumed the cat was black. I felt around to see if my gf (who's currently sleeping next to me) was there but she wasn't. This was all so very vivid, it felt real.\n\nThen another weird thing happened. I pet the cat a little then tried to lift the cat off from me, and it like telepathically started talking to me. It was doing this deep purring but i could hear its voice in my head, it was saying \"I'll take care of you. I'll take care of you\", and like in opposition to me lifting it up, it also gently clawed my hand as i was trying to lift it, but it wasn't aggressive or anything.\n\nI don't know what to make of this. I'm trying to fall back asleep but I can't so I decided to come post here, maybe one of you can tell me what this all means. I'm going to try to go back to sleep, maybe I'll talk to the cat again lol",
    "images": []
  },
  {
    "title": "I was a warrior cat who had to face The Great Jelllyfish Dragon. I was blessed by the starfish of the ocean when I showed mercy. It was an epic fight. Thought I'd share a drawing.",
    "link": "https://old.reddit.com/r/Dreams/comments/l1oyfr/i_was_a_warrior_cat_who_had_to_face_the_great/",
    "body": "I've noticed that showing mercy in dreams is generally smiled upon.",
    "images": [
      "images\\cat\\I_was_a_warrior_cat_who_had_to_face_The_Great_Jell_0.jpg",
      "images\\cat\\I_was_a_warrior_cat_who_had_to_face_The_Great_Jell_1.jpg"
    ]
  },
  {
    "title": "Saw cat moon in my dream last night",
    "link": "https://old.reddit.com/r/Dreams/comments/1jqmtqo/saw_cat_moon_in_my_dream_last_night/",
    "body": "I IMMEDIATELY made this after waking up. This is cat moon. I was at an outside bar when I saw it, I laughed and was trying to get a picture of it when the bartender said “oh that’s cat moon….. we put it on all the time but like no one notices, it makes hormonal changes and everything too” LMAO HELP?!?? It looked exactly like this in my dream too",
    "images": [
      "images\\cat\\Saw_cat_moon_in_my_dream_last_night_0.jpg",
      "images\\cat\\Saw_cat_moon_in_my_dream_last_night_1.jpg"
    ]
  },
  {
    "title": "Had a dream where I stabbed my cat",
    "link": "https://old.reddit.com/r/Dreams/comments/1np1to4/had_a_dream_where_i_stabbed_my_cat/",
    "body": "So I had this dream where I discovered my cat had injured himself and was bleeding a little from the side. Instead of helping him, I thought \"Welp, there's nothing I can do, better just make it faster\" and I stabbed him. He started running around spilling blood everywhere and I instantly regretted it, starting to look for equipment to patch him up. He was basically losing consciousness at this point and I was able to catch him. I fed him because I though that would keep him alive longer and then I bandaged him up and he was as good as new. I think this was the first dream ever where I actually acted in a violent manner without it being self-defense. It was really odd to wake up from this and then see this cat next to me.",
    "images": []
  },
  {
    "title": "Big Cats, Lions, Leopards, Tigers, Etc",
    "link": "https://old.reddit.com/r/Dreams/comments/1kzbp9r/big_cats_lions_leopards_tigers_etc/",
    "body": "My subconscious mind does not like big cats. I have occasional dreams that I wouldn't consider full on nightmares but are pretty uncomfortable. I'll be in the woods at night on a ridge or something dealing with a mountain lion. Or something as escaped from the typical local zoo. Unusually I'm never entirely vulnerable. I'll often have a weapon of some kind with me, but I'm always at a slight disadvantage. These dreams/quasi nightmares are pretty uncomfortable.",
    "images": []
  }
]