[
  {
    "title": "Anyone ever dream of fish swimmimg in the air? I occasionally have this as a recurring dream, looking something like this:",
    "link": "https://old.reddit.com/r/Dreams/comments/1j3teel/anyone_ever_dream_of_fish_swimmimg_in_the_air_i/",
    "body": "Sometimes they are swimming in an aquarium, then keep swimming up past the surface of the water, swimming around in the air in the room.",
    "images": []
  },
  {
    "title": "I dreamt a Russian speaking woman with a blue fish",
    "link": "https://old.reddit.com/r/Dreams/comments/1kfpb25/i_dreamt_a_russian_speaking_woman_with_a_blue_fish/",
    "body": "dreamt I was standing in a field where the grass grew tall and wild. A woman approached, her face hidden behind a rabbit mask, eyes gleaming with blue light. In her hands, she held a blue fish, its scales reflecting the sky above. Around us, mushrooms sprouted from the ground, their caps glowing in the twilight. As I gazed upward, a vivid image of Jesus appeared in the sky",
    "images": [
      "images\\fish\\I_dreamt_a_Russian_speaking_woman_with_a_blue_fish_0.jpg",
      "images\\fish\\I_dreamt_a_Russian_speaking_woman_with_a_blue_fish_1.jpg"
    ]
  },
  {
    "title": "I keep having a dream that I'm forgetting to feed my fish. I don't even have fish",
    "link": "https://old.reddit.com/r/Dreams/comments/1ngkp3h/i_keep_having_a_dream_that_im_forgetting_to_feed/",
    "body": "I keep having a weird recurring dream that I have a fish tank that I've apparently forgotten about and I'm constantly forgetting to feed the fish and I feel terrible. It can be a different fish tank with different fish each time. I don't even have fish and have no idea why I have this dream😅😅 I was thinking about getting some to see if it stops lol. What does this mean??",
    "images": []
  },
  {
    "title": "Fish dream",
    "link": "https://old.reddit.com/r/Dreams/comments/1npthw1/fish_dream/",
    "body": "I had a dream were I was kidnapped and learned the language of some fish people living in a water cube surrounded by police I ended up really liking living with them so when it came time they had to leave they’re home I helped them escape the dream ended before I had brought them to the ocean but since then I’ve had this urge to go underwater and be alone in general I kinda feel like shit and can’t get it off of my mind I want to see the rest but I don’t want to force it I really felt at home with them more then most people in my life",
    "images": []
  },
  {
    "title": "A dream about fish",
    "link": "https://old.reddit.com/r/Dreams/comments/1nn6hhp/a_dream_about_fish/",
    "body": "I started out in my living room in the middle of the night. I looked over at my brightly lit fish tank, and they were twice the size they usually were, and swimming around more aggressively, attacking each other. When I went to go near the tank the fish would start swimming to the surface, and trying to jump out as if they were mad at me.\n\nThen one finally did jump out and it just laid there on the floor and the skin of the fish started growing coral like protrusions at really fast speeds. I quickly grabbed some glossy paper I had laying around so I could put it back in the tank without touching the fish directly.\n\nWhen I finally got it in there the protrusions started going back into its body, and started swimming aggressively again. Then all the other fish started jumping out. That's when I woke up at 3 in the morning on a work day.",
    "images": [
      "images\\fish\\A_dream_about_fish_0.jpg",
      "images\\fish\\A_dream_about_fish_1.jpg"
    ]
  },
  {
    "title": "Hey just curious what a red fish and a blue fish in a dream symbolize?",
    "link": "https://old.reddit.com/r/Dreams/comments/1nrcfxz/hey_just_curious_what_a_red_fish_and_a_blue_fish/",
    "body": "So i had a dream where everything was black. But I could see two fish swimming around eachother like they were chasing eachother’s tails in the sky. One was a blue fish and one was a red fish. My entire dream consisted of them chasing eachother’s tails. They were koi fish if that means something. Ive been able to find what fish mean in dreams but i havent bren able to find any symbolism to red or blue fish chasing eachother. I also was very calm in the dream.",
    "images": []
  },
  {
    "title": "I keep dreaming that I’m queuing, and I also dream that I’m in the middle of a sea full of fish",
    "link": "https://old.reddit.com/r/Dreams/comments/1nmnc6y/i_keep_dreaming_that_im_queuing_and_i_also_dream/",
    "body": "This is very random, but it’s been happening to me often lately. I keep dreaming that I’m queuing somewhere, the place changes in each dream, and I usually have no idea what I’m queuing for. I’m also often talking to someone or trying to move faster in the queue.\n\nLately, I’ve also been dreaming a lot about being on a deserted island and swimming in a sea full of fish.\n\nDo any of you have similar dreams? Do you know what it might mean?",
    "images": []
  },
  {
    "title": "Symbolism of turning into a fish?",
    "link": "https://old.reddit.com/r/Dreams/comments/1nggub0/symbolism_of_turning_into_a_fish/",
    "body": "I dreamt that I was a fish at the bottom of the ocean floor and there were neon lights everywhere. What does turning into a fish symbolize?",
    "images": []
  },
  {
    "title": "Dreaming about fishing. And the moment I catch something I wake up to reel it in",
    "link": "https://old.reddit.com/r/Dreams/comments/1n12kmc/dreaming_about_fishing_and_the_moment_i_catch/",
    "body": "So I had these dreams since a few days, where I am fishing for a big pike, the moment it bites I wake up from my dream to LITERALLY reel it in. Sitting to see check the status of the floater. And even standing up to try and take a closer look. I even woke up 1 night standing up. Trying to search for a '' floater'' I thought I saw, but wasn't there. So I am actively trying to reel this fish in, awake, just sleepy enough to feed the delusion, but just awake enough to try and pinpoint why I confuse my carpet with water.\n\n(I have spend a few days chasing a giant pike fish that has caught my interest. I called her lockjaw, it's the 4th time, the moment I almost grab her, she then bites through the line above the steel fishing line, and gets away, yesterday I spend the entire evening trying to find her in the canal, I got crazy and eventually gave up, tomorrow I am coming back for her. This fish is actually driving me crazy, she is Atleast 1.40m, and i am just sure she knows more than she is supposed to know, everytime I'm almost there the damn line snaps, or gets chewed on, spend a good 5 minutes crying because I felt so bad for the fish because she might be pretty hurt. Since she took my drag '' 3 point hook'' my blinker, my steel line and floater. )\n\nDoes anyone know what this dream means, or is this just downright crazy, please help me out.",
    "images": []
  },
  {
    "title": "Once dreamt a thousand meter wide apex predator type fish was about to swallow me whole",
    "link": "https://old.reddit.com/r/Dreams/comments/1mqizdf/once_dreamt_a_thousand_meter_wide_apex_predator/",
    "body": "Looks like the fish at the end of the ilomilo music video by Billie eilish. Haven't seen it in a while but I instantly recognized",
    "images": [
      "images\\fish\\Once_dreamt_a_thousand_meter_wide_apex_predator_ty_0.jpg",
      "images\\fish\\Once_dreamt_a_thousand_meter_wide_apex_predator_ty_1.jpg"
    ]
  },
  {
    "title": "Dreams about fish",
    "link": "https://old.reddit.com/r/Dreams/comments/1nfbibj/dreams_about_fish/",
    "body": "I've had two dreams about fish recently and I find it interesting. I wonder if anyone has any insight they could offer me.\n\nDream 1:\nIn the dream I was kind of like two people. And the other me was pregnant, with fish. From my pov I was the \"father\" even though I wasn't necessarily a man. At one point in the dream I remember not wanting to go through with becoming a parent. A man said to me, \"I can stop this, but next time you need to let me know sooner\". Then he showed me a sonogram. I could see developed fish fins (there were at least two fish babies) and they were holding spoons. The man was showing me how far along they had developed. When I saw that I said I'm willing to continue.\n\nDream 2:\nIn this dream someone had knitted a giant blanket of fish. (The fish were hole, like they were placed ontop of the knitting.) The blanket was so large and had so many fish that it could have been shared with people in need. I remember thinking it was a waste to not share the fish.\n\nWhen I google things about fish symbolism I see things about pregnancy. But it certainly couldn't be me as I'm not sexually active and haven't been for quite some time. I also don't know anyone who is trying to concieve. Thoughts and opinions are appreciated.",
    "images": []
  },
  {
    "title": "I dreamed of a woman fishing on a floating island",
    "link": "https://old.reddit.com/r/Dreams/comments/1iaukjg/i_dreamed_of_a_woman_fishing_on_a_floating_island/",
    "body": "This dream started with me trying to balance myself on the roof of a very fast train. The train was running in the middle of a forest with tall pine trees that made it very hard to see the ground. The train was very futuristic looking, but it was extremely rusty. I was somehow clinging in that roof, but it wasn't like I was fighting for my life or anything. It actually felt fun, as if I was in a water slide. Behind me were a group of people. Two men and a woman, I think. They were yelling something, but I don't think it was directed at me. After some time, I began to see the ocean in the horizon. I don't remember much after that, but at some point the dream changed. I was not standing in a very small island floating over a pink sea of clouds. On the island was only a small tree, some shrubbery and a lake that was overflowing, somehow, making several waterfalls falling through the clouds. There was also a woman there, sitting on a wooden crate, seemly fishing. The fish line was very long and faded through the clouds. I wasn't even sure if it was hitting the sea. The woman had very long black hair that covered most of her face. She wore white robes like a priest and several adornments that jingled as she moved around. She spoke to me unpromptedly. She had an odd way of talking, it almost reminded me of my aunt's accent, only much more exaggerated. Anyway, at first she talked about Don't Starve of all things. She told me about the last time she played the game, and died on the first day because she forgot to gather wood to make a campfire. I'm not sure why that stood out to me, but it did. She then went on and on about some random things. She talked about the Percy Jackson books, Space Dandy, Avatar and some drawings tips that proved to be false after I tested earlier today. Point is, she talked about a lot of thing and I haven't said a thing yet. Between that talk, she said: \"I like to think that somewhere out there, there's a girl that's just like me. A perfect carbon copy with the same interests and maybe even the same way of breathing. Maybe the only difference between me and her is the fact that I'm the one talking with you right now. I feel unique.\". I thought that was soooo nice of her to say, I was honestly very flattered. It was a very interesting concept too, I thought it was cool. She then proceeded to talk about Kaiji and I woke up soon after. That's all.",
    "images": [
      "images\\fish\\I_dreamed_of_a_woman_fishing_on_a_floating_island_0.jpg",
      "images\\fish\\I_dreamed_of_a_woman_fishing_on_a_floating_island_1.jpg"
    ]
  },
  {
    "title": "My creepiest dream (with a fish)",
    "link": "https://old.reddit.com/r/Dreams/comments/1n5rsuy/my_creepiest_dream_with_a_fish/",
    "body": "Hey! This sub has been recommend to me for some days now, so I decided to take a look and to tell you about my creepiest dream, which I still haven't forgotten.\n\nI was around 17 at the time.\n\nIn this dream I was walking in this infinite maze of hotel corridors (it didnt necessarily feel liminal, it just sort of was there), and I could feel there was this malignant presence there, following me. I kept walking through the maze until I woke up. I was feeling a bit shook, so I went to the bathroom, washed my face and went to sleep again.\n\nAnd there I was, in the same maze, except this time, I could feel that the \"thing\" was closer to me, covering ground. Again I walked and walked until I awoke.\n\nAnd again, when I feel asleep, the same dream. Except this time I could feel he was much closer, enough to feel this hot breath on the back of my neck. I started running and running until I came across a fishbowl in a short table, with a goldfish on it.\n\nHe looked at me and I felt a sense of weirdness, but that I should take a look. The fish simply said to me: \"You know, you should really wake up. If you dont wake up now, there is a chance you will never wake up again\".\n\nAnd just like that, I woke up. Except this time I felt this immense sense of dread, of there being something, some negative energy, in the room with me. Feeling a weird sensation at the back of my neck and such, and decided it would be best to not fall asleep again (it was around 5 am).\n\nNot much happened after, but its still something I think about every so often and wonder \"what would have happened if I didnt wake up?\"",
    "images": []
  },
  {
    "title": "A dream of raising my first fish",
    "link": "https://old.reddit.com/r/Dreams/comments/1n19xcx/a_dream_of_raising_my_first_fish/",
    "body": "I dreamed of raising a fish in a big wooden bowl. I was so happy and a supervisor of a place I will propably get an education in helped me transporting the fish. This is awesome news 😊",
    "images": []
  },
  {
    "title": "I had this dream where an ocotopus killed by beloved fish so I went to the store to get something to kill it and when I came back house was there to stop me",
    "link": "https://old.reddit.com/r/Dreams/comments/1hummv6/i_had_this_dream_where_an_ocotopus_killed_by/",
    "body": "Maybe he's there cuz u assumed your fish was dead but turns out it's still alive, so he's gonna save it before you bleach the octopus which will prolly kill your fish lol.",
    "images": [
      "images\\fish\\I_had_this_dream_where_an_ocotopus_killed_by_belov_0.jpg",
      "images\\fish\\I_had_this_dream_where_an_ocotopus_killed_by_belov_1.jpg"
    ]
  },
  {
    "title": "Dream about two fishes",
    "link": "https://old.reddit.com/r/Dreams/comments/1mbbu4m/dream_about_two_fishes/",
    "body": "In my dream my mother in law gave me two long fish something like eel or sword fish . What does it mean. I also thought in my dream i dont have to eat this big fish while pregnant. So i amnt pregnant right now",
    "images": []
  },
  {
    "title": "I Rescued a Fish Baby in Heaven and It Grew Up to Hate Me…",
    "link": "https://old.reddit.com/r/Dreams/comments/1mo9w44/i_rescued_a_fish_baby_in_heaven_and_it_grew_up_to/",
    "body": "Art is not mine!!\n\nI had a dream that I was in heaven, but it wasn’t the heaven you’d expect—it felt more like a third plane. It was a long, endless stretch of beach or cove. To my left, waves rolled in and out; to my right, towering cliffs loomed, blocking any escape. I could only walk forward or turn back, but no matter which way I went, I always ended up in the same place.\n\nAt first, I was completely alone. Then, people began appearing—but none seemed interested in speaking to me. In this world, you could snap your fingers and have anything you wanted. More and more people arrived, each doing their own strange, random things. My powers, however, weren’t as reliable as theirs.\n\nAs the beach became crowded and chaotic, I drifted away from the noise, walking along the shore and simply observing. That’s when I saw a group of fish people gathered for a wedding ceremony. They cheered as the bride smiled—until suddenly, she went into labor. She gave birth to three babies—adorable yet alien in appearance. One of them was small and frail. Without hesitation, she kicked it aside, and the waves began to carry it away.\n\nI ran toward the struggling baby, but the bride screamed, “Get away from my baby!” I said, “But you don’t want it.” She replied coldly, “It’s my baby, and I want it to die.”\n\nI grabbed the tiny creature and fled as the fish people chased me, even calling in fake roleplay police. Somehow, I escaped. I decided I would raise the baby to be kind.\n\nHe grew rapidly, but despite all my efforts, kindness never took root in him. As a teenager, he was rude, ungrateful, and destructive—spitting, breaking things, rejecting everything I offered. Then, one day, he left to return to his real mother. To my surprise, he looked happier with her.\n\nThat’s when I woke up.",
    "images": [
      "images\\fish\\I_Rescued_a_Fish_Baby_in_Heaven_and_It_Grew_Up_to__0.jpg",
      "images\\fish\\I_Rescued_a_Fish_Baby_in_Heaven_and_It_Grew_Up_to__1.jpg"
    ]
  },
  {
    "title": "Fish dream",
    "link": "https://old.reddit.com/r/Dreams/comments/1mlgsq6/fish_dream/",
    "body": "I think the fish may have been white. Possibly a beta like fish. It kept getting out of the tank. I freaked out cause at one point it got out when I wasn't looking. I found it in the crack of a couch cushion? And it seemed dried and dead. But I put it back in the tank and did little compressions to bring it back to life. And it worked.\n\nAny idea what this could symbolize ?",
    "images": []
  },
  {
    "title": "Reoccurring dreams about fish hooks",
    "link": "https://old.reddit.com/r/Dreams/comments/1md97fw/reoccurring_dreams_about_fish_hooks/",
    "body": "I've had dreams/nightmares about fishing hooks ever since I was a child - generally speaking there is someone else (usually a threat to me) holding a fishing rod and trying to grab me with the hook. The person isn't anyone I know, they're usually faceless.\n\nThey're sort of moving the rod and hook around, seemingly trying to hook me. It never actually happens, but I'm filled with fear of it piercing my skin with a huge focus on my eyes. Sometimes I'm able to grab the rod and subdue the danger, other times it's just an endless chase of me moving out of the way and them trying again.\n\nI've always been sort of uneasy around fishing rods in real life, due to a fear of being hooked. I've only been fishing a handful of times, when I was very young. Is this just a weird phobia of hooks coming through in dreams, or something potentially more?",
    "images": []
  },
  {
    "title": "What could be the meaning of dreaming about a panoramic elevator and giant fish?",
    "link": "https://old.reddit.com/r/Dreams/comments/1mfozj2/what_could_be_the_meaning_of_dreaming_about_a/",
    "body": "I dreamed that I was going up in a panoramic elevator and in front of it there was a canal where a school of giant fish passed by, when I got to the floor it was a doctor's office where I met the doctor and said that he had never seen such big fish in that canal, the doctor showed a bill for R$100.00 and pointed to the fish printed on the bill, which in this case was a grouper. remembered",
    "images": []
  },
  {
    "title": "I had a dream last night where I became a mutated fish person at an amusement and water park hybrid",
    "link": "https://old.reddit.com/r/Dreams/comments/1ltim5v/i_had_a_dream_last_night_where_i_became_a_mutated/",
    "body": "So last night I had a dream where I was at a theme park with my family and one of the attractions we checked out was this strange water obstacle course/ race. We were running along it but near the end there was this bridge section. And for some reason my body started to… change. My fingers began to grow thin strips of skin and fuse together as my skin began to change colour as I turned into a sort of fish/human hybrid. And I don’t mean like a creepy one I mean it similar to someone like nina from creature commandos. Still human but having some properties that a fish would have. It was strange and kinda freaky but it felt southing. Almost like a reassuring hug.\n\nBut then it got even stranger with what happened next. You know when you have a dream you sometimes go from one area in it to a completely different area in the dream. That’s what happened. I was now in a strange building (still a fish person) and now wearing a sort of breathing suit and standing with a scientist person (who for some reason was scarlet johanson) near me talking about dna restructuring a transformation. They had another person with them who I think was another mutated person(who for some reason was Robert Downey jr) I don’t know why but they were sort of deformed and turned into a semi pile of jelly. Still vaugly human but mostly puddle of jelly. They were then placed in a machine and closed the lid beginning a process to do, something. And then it cut again.\n\nThis time back into the theme park in a sort of cut off area next to the obstacle course area that led to the same ending area where I turned into a fish person. I went along the path everyone else was going. But I felt calm and at ease unlike everyone else who seems almost frantic with their swimming. I enjoyed seeing underwater and it wasn’t what you would usually expect a theme park water area to look like. It was massive, colourful and filled with all these magical looking fish. A swam around underwater with them for a long time before returning above water to now be back at the bridge area where I transformed.\n\nI went with everyone else and ended up in a theatre area. But before the show could begin, it cut away again.\n\nIt cuts back to the scientist room where she is asking for help with the patient. I look at them and their body fully transformed into a rainbow jello like cylinder. The scientist told be they were fine and asked me to help them move the patient. We moved him to another room and then she told me that it would only take a moment for the process to complete. And after saying that I see a heavy suit on a couch and when I reach out to touch it. Cut away.\n\nI was now again in the same water park area. Only now I was on a raft shooting targets above the water. Once I shot all of them once again I was transported to the bridge. I felt at ease with myself, calm joyful, and happy. And as I was cross in the bridge alone I can see colour and lights that I didn’t see before. And once I make it to the theatre door. It cut away, one last time.\n\nI was now in a car with my mom and eldest older sister. We were driving away from the theme park and I was no longer a fish person I was back to my normal self. My mom asks me what I thought of the park. I said it was good it was fun. My eldest sister asked me if I wanted to return someday. I said yes. And as we are driving away and they are talking they try to talk to me but I was to tired from the time we spent at the park. And the. I woke up\n\nIt was about 8:37 am when I woke up and it felt strange. I wasn’t startled by the dream. Or puzzled as to what happened. But still I felt calm and almost relaxed by it. And as a layer there in bed I thought to myself. “That was a (mostly) pleasant dream”\n\nAnd that’s the story of the of the weirdest dreams I have ever had.",
    "images": []
  },
  {
    "title": "Dream Recreation: The fish conglomerate",
    "link": "https://old.reddit.com/r/Dreams/comments/fu9a5x/dream_recreation_the_fish_conglomerate/",
    "body": "This is super pretty!",
    "images": [
      "images\\fish\\Dream_Recreation__The_fish_conglomerate_0.jpg",
      "images\\fish\\Dream_Recreation__The_fish_conglomerate_1.jpg"
    ]
  },
  {
    "title": "I had a dream last night about me and Saadam husan (idk how to spell it) talking about fish that looked like corn.",
    "link": "https://old.reddit.com/r/Dreams/comments/1khhsp1/i_had_a_dream_last_night_about_me_and_saadam/",
    "body": "What does this mean :(",
    "images": []
  },
  {
    "title": "My Crazy Monster High Dream (First Segment: Show and Tell. Second Segment: Local Puffer Fish Kidnapped by Wario)",
    "link": "https://old.reddit.com/r/Dreams/comments/1ll3kyq/my_crazy_monster_high_dream_first_segment_show/",
    "body": "Last night, I dreamt I was in a Monster High-esque setting, and the dream was separated into two segments. In the first segment, a Clawdeen look-alike was doing a show and tell of her pet bat. The students were afraid of the bat at first, but they eventually warmed up to him at the end. In the second segment, I was a pet puffer fish (that can walk and breathe on land) that belonged to a kid with electric powers who looked a lot like Zenitsu Agatsuma from Demon Slayer. In this particular segment, I thought I was being neglected by my owner and was so fed up with my current life that I fled my owner while he was busy having a party with his friends and teachers in the school gymnasium. Once I was outside the school, fleeing my owner, I thought it would be time to find a new owner that would take care of me no matter what, so I went to a couple houses in a neighbourhood near the school, but for some reason, most of people living in the neighbourhood are terrified of me. However, they only seem to be scared of me when I'm in their line of sight, so I decided to exploit this by hiding and showing myself quickly in front of two guys living together, to get them to make funny noises and make myself laugh. But as I was doing this, I spotted Wario to my left, who then grabbed me, inflated me as if I were a balloon and used me to float across the neighbourhood alongside his three other balloons. I was so terrified that I tried to free myself, but it was no use. Meanwhile, my owner realized that I, his pet puffer fish, had gone missing and invited his friends along to get out of the school and try to find me. After a few minutes, they eventually caught up to me, who was being used as a balloon by Wario. My owner and the other students had to slap Wario’s butt as hard as possible a couple times to convince him to let go of me. Once he let go of me, Wario ran as far away from us as possible, and I was reunited with my owner, who apologized to me for neglecting me earlier. I then apologized for running away from him, and we both reconciled by hugging each other.",
    "images": []
  },
  {
    "title": "Forget to feed fish",
    "link": "https://old.reddit.com/r/Dreams/comments/1kod2dm/forget_to_feed_fish/",
    "body": "I have been having this reoccurring dream for decades that I have multiple fish tanks and I forget to feed them for weeks or even months.\n\nWhen I realise, my stomach drops and the panic is intense. I race to the tanks ( sometimes they are covered with blanket) and see the water level is a few inches and they are all still alive….only just.\n\nI feed them and fill their tank with fresh water and feel extremely guilty. I also have this with a chook pen.\n\nAnyone know what this may symbolise or have the same type of dream?",
    "images": []
  }
]