[
  {
    "title": "four winged bird with human face dream meaning?",
    "link": "https://old.reddit.com/r/Dreams/comments/1g3v5ag/four_winged_bird_with_human_face_dream_meaning/",
    "body": "I had a vivid but very brief dream about a beautiful bird lady descending from the sky above me. She had two sets of wings and a human-like face surrounded by wild glowing hair. I woke up and drew her immediately. Does anyone know if this has any symbolic meaning? I’ve been trying to interpret this because it was so vivid but I don’t know what it could mean.",
    "images": [
      "images\\bird\\four_winged_bird_with_human_face_dream_meaning__0.jpg",
      "images\\bird\\four_winged_bird_with_human_face_dream_meaning__1.jpg"
    ]
  },
  {
    "title": "I had some nightmare where I got stuck in a dimension which consists of nothing but a floor and a ceiling with some sort of bird head for its pattern",
    "link": "https://old.reddit.com/r/Dreams/comments/1gyhvxw/i_had_some_nightmare_where_i_got_stuck_in_a/",
    "body": "ANNOUNCEMENT: The next session at Owls School of Dreaming (DreamSchool.net) starts Nov. 5. Join us in learning the art and science of dream interpretation from this sub's resident dream expert, RadOwl.\n\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
    "images": [
      "images\\bird\\I_had_some_nightmare_where_I_got_stuck_in_a_dimens_0.jpg",
      "images\\bird\\I_had_some_nightmare_where_I_got_stuck_in_a_dimens_1.jpg"
    ]
  },
  {
    "title": "From birds' nest to under water",
    "link": "https://old.reddit.com/r/Dreams/comments/1nnixt2/from_birds_nest_to_under_water/",
    "body": "I usually don't dream much but when I do, 'usually' I am aware I'm dreaming and I let it play it out. And I tend to question \"why?\"\n\nThe dream: I was on a very tall tower, what felt like a bird's nest on a ship. And I was looking around and I saw the deep blue sea. I was not supposed to do anything but just lookout. I realized some repair was due and I noticed someone at the base fiddling with a control panel. Right in front of my fase there was 2 bolt holding something and the controller with a flick of a button removed the 2 bolts. I was telling myself \"wow.. Such amazing technologies\"\n\nThe a person appeared in front of me next to the tower and he replaced something and rebolted the unit back on. I was wondering how he got up so fast.\n\nThe I felt the shift had ended and how I was to get down was after after the tower had fallen on to the sea. I did not feel any fear (I am some what afraid of both the deep ocean and heights)\n\nThe tower fell, and I was in the ocean and I had 2 people swimming next to me as I confidentiality attempted to swim (no I can't swim irl but I forgot about it) But I just kept going down and down and away from everything and everyone, under the deep blue waves and heavy currents.. And I just felt awful and in the dark and I decided to end the dream.\n\nAny interpretation?",
    "images": []
  },
  {
    "title": "Having vivid dreams about neglecting a pet bird - for years",
    "link": "https://old.reddit.com/r/Dreams/comments/1kckizk/having_vivid_dreams_about_neglecting_a_pet_bird/",
    "body": "I desperately wish someone could just hand me literal text about what my subconcious is trying to tell me so I could get these reccurring dreams out of my head. I know that the audience in this sub might not be able to do that, but I'm hoping for some insight. Anything, really.\n\nThe dreams always start by me hanging out in either one of two apartments that I lived in growing up, staring out of a window into a beautiful sunny day. And then I suddenly, in a complete panic, remember my pet budgie, which I by mysterious dream logic have decided to temporarily move into a laundry room (way bigger than I ever grew up with) because I had to clean the apartment.\n\nNow, this is where it gets nightmare-territory for me because I adore all animals and I cannot imagine any scenario in which I could ever do the following. I've apparently forgotten this bird for so long in there that the budgie had no food or water left, and somehow survived like that long enough for its tiny feet and claws to grow into grotesque, painful shapes. Like a neglected horses hoof. I'm talking years in time, somehow.\n\nI do not understand how this poor budgie simply isn't dead, but my dream self spring into action. I try to feed it, give it water, fix its feet and claws, but it is impossible. I'm always unable to fix my own neglectful actions, and I always wake up in despair because this poor bird is squawking at me in distress and I was the cause of its misery.\n\nThese are very short dreams, and the bird is not always trapped in a laundry room. Sometimes it's the balcony with the cage door open, and because of my neglect the bird just couldn't fly away.\n\nI had a pet budgie growing up, and nothing bad ever happened to him. We had a wonderful time together. I also don't think the dreams are about him because he was yellow and green, and the budgie from my dreams is always white and blue.\n\nThese dreams resurface maybe every other month, without any rhyme or reason and I just don't know if this is a very specific anxiety dream, or if this is a sign I should seek out an exorcist.\n\nAny thoughts?\n\nEDIT: i'm very grateful for all of your replies! It is both horrifying and a relief for me knowing that so many other people have these dreams, and that we share so many similarities in terms of grief, guilt and pain about not being able to help our pets. I'm so happy that we all deeply care about all these wonderful animals!",
    "images": []
  },
  {
    "title": "I've been seeing these birds in my dreams a lot. they are like normal white doves but with a long tail. is there a meaning to this?",
    "link": "https://old.reddit.com/r/Dreams/comments/xxa1q3/ive_been_seeing_these_birds_in_my_dreams_a_lot/",
    "body": "Google \"fancy pigeons\". There's a type called fan-tail pigeon which is similar, but the tail isn't as long and wispy. Maybe your mind is predicting a future fancy pigeon breed.",
    "images": [
      "images\\bird\\I_ve_been_seeing_these_birds_in_my_dreams_a_lot__t_0.jpg",
      "images\\bird\\I_ve_been_seeing_these_birds_in_my_dreams_a_lot__t_1.jpg"
    ]
  },
  {
    "title": "Dream bird creature tells me to end my life repeatedly",
    "link": "https://old.reddit.com/r/Dreams/comments/1i3yywi/dream_bird_creature_tells_me_to_end_my_life/",
    "body": "I remember it extremely vividly, and it's been stuck in my head all day through classes.\n\nI dreamt I was driving on some backroad in a forest while it was raining. Out of the side mirrors, I see this large black eldritch horror looking flamingo approaching my car. I try to speed up, but no matter how fast I go, it just keeps approaching at the same speed, and eventually I run out of gas. It comes up to the car window, bending it's neck down, and just stares at me in the eyes. It does this for a while before I roll the car window down, thinking it's the only option I really have left. It begins talking to me casually, talking about various subjects before abruptly telling me to kill myself. It starts repeating this, over and over again. This goes on until I wake up, but it felt like days.\n\nNormally, I wouldn't be scared or paranoid about dreams this zany, but it's been on my mind all day. I've heard and saw that bird a lot today in class. His face and voice just have just been lingering in the back of my mind and I don't know how to make it leave. I have faced heavy mental challenges in the past, though other than having DPDR episodes every now and then, I can't say anything is wrong in my life right now. I'm the happiest I've been in years, and I'm thankful for everything around me, so I don't understand why this would mess with me the way it has been.\n\nTL;DR - giant bird tells me to repeatedly kill myself, it scares me, and I can't process it",
    "images": []
  },
  {
    "title": "I had a dream where a bird told me I wasn’t supposed to see what i was seeing",
    "link": "https://old.reddit.com/r/Dreams/comments/1l78clk/i_had_a_dream_where_a_bird_told_me_i_wasnt/",
    "body": "The dream started in my backyard at night and i don’t remember what exactly came before but I remember when I started talking to a red finch or northern cardinal pparently his name was Dave. He told me that I wasn’t supposed to be able to understand him or hear him and he flew into the tree in my yard.\n\nI couldn’t get him to come back so I just went into the garage and started closing the back door before a knock was heard and Freddie Mercury appeared in the door. But it wasn’t really him, he looked off, uncanny. I think it was just the bird trying to lure me out but I came out anyway. Freddie was playing with my dog that had somehow gotten outside and he didn’t say a word.\n\nBut the bird flew down in front of me, I don’t remember what he said but I do remember asking him what the weird glowy tunnel looking thing coming from sky and into my neighbors yard was. He looked a little shocked (at least from what i can tell cause he was a bird), he flapped his wings and i turned back to the tunnel and it was moving away, slowly disappearing. He then told me I wasn’t supposed to see that and I woke up.\n\nIdk it was a weird dream😭 I did see a red bird the day before too",
    "images": []
  },
  {
    "title": "I had a super interesting dream about this one dude named Egg Boy and this weird baby bird human hybrid thing singing to the sky",
    "link": "https://old.reddit.com/r/Dreams/comments/1nl7ifk/i_had_a_super_interesting_dream_about_this_one/",
    "body": "This dream started with me going up a flight of stairs on a very rustic and old looking building. The walls were made of stone, and the stairs were adorned with a fancy looking red carpet. It felt as though I was on Hogwarts or something. I remember feeling kind of upset, I'm not sure why. The feeling went away when I reached the end of the stairs and found myself on a decorated corridor. The whole place stunk of \"academia\", and the stereotypical regal architecture you'd expect from british castles. When I arrived there, I saw a man sitting on a red armchair. He wore fancy clothing, but he was young. I knew who he was at the time, and I couldn't help but to smile when I saw him. We spoke in a funny way. We obviously knew each other, but for some reason we were going through loops to make it seem like it was the first time we met. He would say something and then ask \"Say, have we met?\" and I would say \"Why, of course not, there is no possible way I could've met you!\". It was theatrical, like we were mocking whomever was listening to us. It was super interesting. I no longer recall that man's name, but I do remember calling him \"Egg Boy\" several times throughout the conversation, and he would call me \"O, death\". It was never just \"death\", it was always \"O, death\". We talked for a long time, and after a while he decided he wanted to show me something. I followed him through another flight of stairs. This one was circular and cramped, like we were going up a castle tower. Occasionally I would pass by a window where I caught a glimpse of the outside. The sky was pure white, and the castle we were at seemed to stretch into infinity, disappearing in the horizon. As we went up, I started to hear a song echoing through the castle. It was grainy, like it was being played on an intercom, or maybe a gramophone. It was a solemn, foreboding melody playing on a loop. It was the kind of song you'd hear on info channels. It only got louder as we went up the tower, like the song was coming from the sky itself. When we reached the top, we arrived at some sort of observatory. At least, it was shaped like so. The roof was dome shaped, with a hole in the center to look at the sky. The floor around the large empty room was covered with dead grass, and at the center of it all was a weird thing. It was a strange creature, like a mixture of a baby bird and a grown human. Its skin was pinkish as if it was just born, with short white hair. Its eyes were bulging out of its body, and its mouth was malformed. The thing was looking to the sky, and paid no attention to us when we arrived. The thing was, like, singing to the music outside. Whenever a specific part of the loop came, the creature would let out a pitiful little sound that matched the melody, as though it was answering it. It was like a high pitched foghorn. Nothing happened when the thing spoke, and I'm not sure it even knew what it was doing, but it was super super interesting. I thanked my friend for showing me that, and then he went on his way. He said \"It's going to be nice meeting you again!\", before he left. For the rest of the dream I made several attempts to find him again, but wasn't able to. That's all.",
    "images": [
      "images\\bird\\I_had_a_super_interesting_dream_about_this_one_dud_0.jpg",
      "images\\bird\\I_had_a_super_interesting_dream_about_this_one_dud_1.jpg"
    ]
  },
  {
    "title": "Blue Bird Significance ?",
    "link": "https://old.reddit.com/r/Dreams/comments/1nnl5er/blue_bird_significance/",
    "body": "within the year i have had a reoccurring dream that small blue bird that appears and is almost like a pet. the context of the dream always different but in the dream i will find a small blue colored bird and it will let me hold it and it will sit on me the rest of the dream. i’m always shocked how friendly it is the the dream and the way it wants to stay with me always like a pet. is there any meaning behind a little blue bird in your dreams? i just find it strange because how this has happened multiple times.",
    "images": []
  },
  {
    "title": "Birds in dreams",
    "link": "https://old.reddit.com/r/Dreams/comments/1nsis4i/birds_in_dreams/",
    "body": "Hello everyone,\n\nI just woke up this morning and i have a dream that i found a bird that was scared and injured but couldn’t let it die.\n\nSo, in my dream, i was looking for a cage to keep it but couldn’t found one. It was either so small or the bird could escape.\n\nIdk what this means, i never dream about birds.",
    "images": []
  },
  {
    "title": "Big Bird",
    "link": "https://old.reddit.com/r/Dreams/comments/1nrf0dg/big_bird/",
    "body": "I was in a random dark house with all its curtains drawn on a bright sunny day and heard a man saying something frantically outside. I run to go outside to see what’s happening and take an ornate green door with a bird styled as the handle onto the back deck of the house. There I see a giant bird saying “Bad bird. Bad bird. Bad bird. I shouldn’t have done that” to himself and he is projectile vomiting the remains of smaller birds all around himself. He takes flight and flies away.\n\nI just observed what was happening and then started descending a ladder into a bright blue pool. . I’m usually able to interpret my dreams pretty easily but this one threw me off with the parts my brain deemed important. My friend said it sounds like an episode of Courage the Cowardly Dog 😭",
    "images": [
      "images\\bird\\Big_Bird_0.jpg",
      "images\\bird\\Big_Bird_1.jpg"
    ]
  },
  {
    "title": "Disturbing dream about pet birds",
    "link": "https://old.reddit.com/r/Dreams/comments/1ngh4kv/disturbing_dream_about_pet_birds/",
    "body": "This is the first time I have posted about a dream, but the dream I had a couple of nights ago was so weird and disturbing that I just had to share it …\n\nBackground: I had an aviary when I was a teenager. I enjoyed it and took good care of my birds (budgies, cockatiels and quails). I now live in an apartment with my husband - we have two budgies who live in a big cage on wheels (a parrot cage). They are so cute and I spend a lot of time talking to them. The cage is on the balcony in good weather, and is wheeled indoors during hot or cold weather. It also gets wheeled in regularly so the birds can be let out to fly around the apartment. We are dog people and had a lovely little dog who died 2 yrs ago. We were devastated but on a practical level it made things easier as she got quite anxious in the apartment. I’m not sure how relevant any of this is to my dream …\n\nAnyway, my dream involved me having an aviary. I didn’t recognise where I was living in the dream. I don’t think I was a teenager - I feel like I was an adult, but it wasn’t my current home and I don‘t know if I was married etc. I suddenly remembered the aviary and I panicked! It was down an alley next my home. I don‘t know how long I had forgotten about it for, but I was fully expecting the birds to be dead. The dread and panic was truly awful. \n\nI don‘t know what kind of birds I had in this aviary. I ran to the aviary and all the birds were skeletons - like you might see in a nature museum. Not piles of bones - but intact organised skeletons, just without flesh/feathers. The skeletal birds were sitting on perches - somehow still alive. They seemed to be the shape/size of pigeons. They were not happy and chirpy - they were just sitting on perches, looking surreal and creepy - but alive.\n\nWhat is going on here??!!",
    "images": []
  },
  {
    "title": "Having talons (bird claws) and removing one.",
    "link": "https://old.reddit.com/r/Dreams/comments/1nnf0cv/having_talons_bird_claws_and_removing_one/",
    "body": "In this dream, I had talons(claws like those of birds of prey). One of my talons was giving me discomfort, so I removed it. Just as a crab would remove its pincer when it goes bad. When I removed the talon, I felt sweet relief. A catharsis of sort. The talon was throbbing even when it was removed.( My middle finger gives me discomfort as it got slightly injured when I fell. I also had seen a yt short earlier where a dog catches a big lizard by tail, and the lizard drops its tail, which the dog messes around with. The tail was writhing.)\n\nWhat's your opinion?",
    "images": []
  },
  {
    "title": "The weird dream about dying birds",
    "link": "https://old.reddit.com/r/Dreams/comments/1nglow9/the_weird_dream_about_dying_birds/",
    "body": "I've been having a lot of weird dreams lately, but this one takes the cake for being the most confusing and unsettling yet. Dying birds kept flying to me (not sure if i was in some sort of void or my house). They were still alive, but barely, they wanted to specifically die in my arms. I was scared to touch them, i have a lot of little wounds on my fingers. I remembered my mom telling me to never touch animals, cause i might get some disease. When the first one came, i was just sad about that little guy, but didn't touch him. But they kept coming. One by one, little birds wanting to feel the touch of my hands as they died. I kept declining. After like, maybe a 7th i started crying and desperately asking why me, why they kept coming to me. I took the last bird in my hands, and then the dream was over. I'm not sure what to get from it. Does it have any meaning. I don't know.",
    "images": []
  },
  {
    "title": "I saw conjoined birds in my dream last night, does it mean anything?",
    "link": "https://old.reddit.com/r/Dreams/comments/1l5ijop/i_saw_conjoined_birds_in_my_dream_last_night_does/",
    "body": "In the dream I randomly saw the birds fly by my window and then I ran outside to investigate. One bird was light blue and the other was light pink (probably not a natural color.) When I ran outside, my brother and his old friend ran outside with me and then his friend managed to catch it. After we all looked at it, he sent it free. My old best friend did later appear in the dream and was in it until I woke up, she's been ghosting me for a bit now, I believe it has something to do with her. It also took place in my childhood home which is also probably the place I spent the most time with my old friend.\n\nMy brother's friend and my friend are also siblings which I believe is why he appeared. I also usually lucid dream if that could effect it.",
    "images": []
  },
  {
    "title": "Angry Grey Birds attacking me in dream",
    "link": "https://old.reddit.com/r/Dreams/comments/1lw0cmn/angry_grey_birds_attacking_me_in_dream/",
    "body": "I (23m if it matters) had this dream last night and its really bugging me, as my dreams don't normally stick around longer than about 30 minutes even after talking about them with my wife.\nAlso, please excuse any poor formatting, I don't really understand reddit. But,\n\nI was getting on a bus to head home (from where I don't know). I stepped on the bus, asked the driver if the bus went through the town I live in, he said yes, I sat down. I rode through the bus route for what felt like hours until I started noticing the bus route repeating without having gone through my town. I recognized where we were as being about a 10 minute walk from my mom's house, so I figured I'd just hop off and walk to my mom's house, call my wife to come get me, etc.\n\nI get off the bus, start walking towards my moms house and the sidewalk is blocked by a woman wearing a purple and black striped pantsuit with 6 grey birds standing in front of her, all 4-6 feet tall, all of them raising their wings to appear threatening. I ask her if she's okay, and she just chuckles at me and walks away. The birds started walking at me slowly and I noticed one of the smaller ones getting a little too close. I kicked it and sent it back a little ways. Then, my eyes got really heavy. I'm backing up and trying to hold them open to keep fighting off these birds and I run into a wall with a handrail on it. I grab onto the handrail and start kicking blindly. I feel my foot connect with one of the birds, it screams, and I wake up.\n\nI feel like this dream is something trying to tell me something, or my brain trying to tell me to fix something and I don't really know where to go from here. Should I just ignore it? Any help is much appreciated.",
    "images": []
  },
  {
    "title": "Bird dream??",
    "link": "https://old.reddit.com/r/Dreams/comments/1n3r5q7/bird_dream/",
    "body": "I had dream that I went to my friends college and in a clsssroom when I opened a window a crow came out flying and attacked me or actually trying to sit on my head later other birds also gathered around me. What does this mean? I don’t usually think too much about dreams but I’ve been getting dreams for a while",
    "images": []
  },
  {
    "title": "Weird reoccurring dream with bird skull",
    "link": "https://old.reddit.com/r/Dreams/comments/1mq52f6/weird_reoccurring_dream_with_bird_skull/",
    "body": "Had a dream that happened 2 nights in a row now, where I am in this ancient like city with someone (don't remember who) and we awaken something, it ends up being this 9 foot tall creature that's head is a bird skull, we try to run and my friend gets hooked by it and pulled back i run through the city and i hear these loud ground shaking footsteps as it chases me, and everywhere I go i see statues of this thing. I wouldn't have made this post if it hasn't happened twice in a row now.",
    "images": []
  },
  {
    "title": "Ring of headless birds dream - any ideas what this means please? *Gruesome Dream Warning*",
    "link": "https://old.reddit.com/r/Dreams/comments/1mwy8rc/ring_of_headless_birds_dream_any_ideas_what_this/",
    "body": "Hey all!\n\nI had this very vivid dream where I was in a forest with a log cabin to my right, and there was a circle of 12 slabs of stones with another one in the center. The first time I visited this place in my dream, it felt eerie, but nothing happened and I moved on to somewhere i don't remember.\n\nNext thing I remember is coming across these stones again, and feeling even more unsettled and scared. I look around and see a headless raven in the centre stone (no head is anywhere to be seen, but the body is upright, there is something blood and feathers everywhere). Dream me sees this and gets out of there as quickly as I can and goes back to somewhere I don't remember.\n\nThe next thing I remember is returning to the ring of stones for a final time, but this time there are 12 headless birds, each placed on a outer circle stone. They were placed upright in the same way that the raven was, again with no heads in sight and feathers EVERYWHERE. They were 12 different types of birds and I'm not sure of most of them, but the raven was there (maybe a different one to before, I dont know) and a headless seagull. I did not see what was on the center stone as I was so terrified and had to get out of there before whatever got the birds \"got me\". It felt so sinister, and I get the impression that it was some kind of sacrifice.\n\nI very rarely dream, and it's never this graphic when I do. Any ideas what this could mean?\n\nLooking forward to hearing your responses!",
    "images": []
  },
  {
    "title": "Strange dream involving a chick, birds, and an intense ending , what could it mean?",
    "link": "https://old.reddit.com/r/Dreams/comments/1mif2eu/strange_dream_involving_a_chick_birds_and_an/",
    "body": "Last night I had a really vivid and unsettling dream that stuck with me all day. I’m curious what others might think it means.\n\nIn the dream, I was walking somewhere unclear when I noticed a tiny, newly hatched chick on the ground. It barely had any feathers, completely defenseless. Out of nowhere, a larger brown bird swooped in and started attacking it.\n\nThen a black bird, which I assumed was the chick’s mother, came flying in and chased the brown bird off. But just as it flew away, another brown bird appeared from the other side, threatening the chick again. I stepped in and shooed this second bird away.\n\nWhen I looked back, the chick seemed safe. But suddenly, the black bird, the one I thought was the mother, returned and attacked me. It pecked at my toes and then latched onto my big toe with its claws. I could feel it clinging to me, painfully tight and oddly realistic.\n\nI didn’t fight it off, just stood there hoping it would release me. After a while, I realized the bird had died, still attached to my foot. I opened its beak and confirmed it was lifeless. I slowly peeled its claws off my toe one by one.\n\nThen I heard the chick crying again in the distance. I turned toward the sound and started walking… and that’s when I woke up.\n\nMy baby was born 2 weeks ago, we are happy and seem stress free… no money problems or health problems…\n\nAny thoughts on what this might represent? It felt symbolic, but I can’t quite figure out what it’s trying to tell me.",
    "images": []
  },
  {
    "title": "Why so I dream constantly of dead or wounded birds?",
    "link": "https://old.reddit.com/r/Dreams/comments/1m7z65y/why_so_i_dream_constantly_of_dead_or_wounded_birds/",
    "body": "I've been having reoccurring dreams of dead birds and I kinda wonder and ponder about them lately.\n\nDream one:\n\nI am walking down a small concrete path trough an emerald, very beautiful woods. I see on the side a dead starling. I wonder if my cats did that. I continue walking. Two more dead starlings. I feel sad for the birds.\n\nDream two:\n\nI am in a place from childhood, in the middle of the night. I see my cat (one that I'm very fond of) attacking a magpie. I feel scared for both - I don't want my cat to kill the magpie, but I don't want the magpie to hurt my cat either. I manage to save the magpie from my cat, and it flies off, but I see my cat has taken its eye out. I feel worry for the magpie, and wonder if it will survive. I turn around and I see hundreds of cats eyes, glowing, watching me from the dark.\n\nDream three:\n\nI am in my house and I see trought the window that same cat from Dream two, attacking a small sparrow. I rush to save the sparrow, but my cat runs away with it. I chase her and I see she left the sparrow on the top of the car, but it looks like a bigger bird now. Then I find myself opening the trunk, and I see a beautiful, iridescent and colourful pigeon dying. It's implied that it's the same bird that my cat caught. I take it into my hands and I cry sorrowfully while it's dying.\n\nDream four:\n\nI am walking up some huge stone, beige stairs. Somewhere outside. There's nothing but these stairs. I feel crushing pain in my head and my face and I struggle with it as it comes in waves. I look at the stairs and I see a huge black crow, dead on those stairs with sprawled wings. I feel sorry for the crow.\n\nSo yeah. Idk, I don't dream all that much, but when I do, some of them are so intense and vivid. I have much stranger dreams, but idk. This bird dreams I've been having trough the last year and this last one I dreamt about two nights ago, I just can't get it out of my head. I am going trough a depressive period, but these bird dreams started before that. Also, I never blame the cats. I know it's their nature. I just try to save the birds, or feel sad for their demise.",
    "images": []
  },
  {
    "title": "Stupid birds",
    "link": "https://old.reddit.com/r/Dreams/comments/1m4oxxj/stupid_birds/",
    "body": "Last night I dreamt that I had something nibbling or biting at me and I opened my eyes and I was on a tropical island and it was very sunny but I was surrounded by dodo birds. They would walk up to me out of curiosity and peck at me.",
    "images": []
  },
  {
    "title": "Momo mother bird breaking news",
    "link": "https://old.reddit.com/r/Dreams/comments/1m85v9l/momo_mother_bird_breaking_news/",
    "body": "So today I've been dreamed of momo making a breaking news show or a fun show like games or smth, unfortunately, momo didn't come because I wanted to see her. ( Sorry for short context )",
    "images": []
  },
  {
    "title": "After my husband’s passing, i always see cardinal birds and 333 and 11:11 everywhere",
    "link": "https://old.reddit.com/r/Dreams/comments/1m2gwxo/after_my_husbands_passing_i_always_see_cardinal/",
    "body": "Can anyone tell me what these signs means? I am from a different culture. But i get those almost everyday.",
    "images": []
  },
  {
    "title": "Just had this dream (phoenix like bird?)",
    "link": "https://old.reddit.com/r/Dreams/comments/1lzaht7/just_had_this_dream_phoenix_like_bird/",
    "body": "Was walking with my mum on a street near our home and a phoenix like bird like a vulture with orange colour but not tattered landed next to us I pulled out my phone and started screaming but couldn’t move, my mum was saying “aww” as it came closer to me. I screamed again and I lunged onto to me and I tried to fight it back but everything was silent no sound at all and it pierced my neck, there was still no sound I was sprinting away passing my mum holding my neck and I was bleeding everywhere then I was in blackness for about 5 seconds before waking up gasping.",
    "images": []
  }
]