[
  {
    "title": "Had a dream in which I had a little figurine of a lion eating a snake",
    "link": "https://old.reddit.com/r/Dreams/comments/1nhsi6a/had_a_dream_in_which_i_had_a_little_figurine_of_a/",
    "body": "Dream was weird. In it, I wasn't able to sleep because of some weird monster hand banging on my window. So I got off from my bed, that was for whatever reason next to a computer lab, and I started watching some old Youtube stuff while playing with the little lion figurine that was just sitting there on one of the computers.",
    "images": [
      "images\\snake\\Had_a_dream_in_which_I_had_a_little_figurine_of_a__0.jpg",
      "images\\snake\\Had_a_dream_in_which_I_had_a_little_figurine_of_a__1.jpg"
    ]
  },
  {
    "title": "So I had a dream where snake bit me into my hand. Today I woke up with these two marks on the same hand, where the snake bit me. That’s some interesting confidence haha.",
    "link": "https://old.reddit.com/r/Dreams/comments/urw6t0/so_i_had_a_dream_where_snake_bit_me_into_my_hand/",
    "body": "There might actually be some science to this. Maybe your hand actually was on two things that stimulated your dream into a snake bite, or your body reacted to the dream and it actually appeared without external stimuli. Just like the heart races during a nightmare and genitals stimulated during a wet dream, so is the rest of the body. I once had a dream where a pterodactyl bit me and I woke up twitching, that part of my body numb. Just a theory though.",
    "images": [
      "images\\snake\\So_I_had_a_dream_where_snake_bit_me_into_my_hand___0.jpg",
      "images\\snake\\So_I_had_a_dream_where_snake_bit_me_into_my_hand___1.jpg"
    ]
  },
  {
    "title": "Sponge bob taught me the difference between Sea snakes and Sea dragons on google classroom",
    "link": "https://old.reddit.com/r/Dreams/comments/ivty5l/sponge_bob_taught_me_the_difference_between_sea/",
    "body": "Yeah, it's all about the frequency",
    "images": [
      "images\\snake\\Sponge_bob_taught_me_the_difference_between_Sea_sn_0.jpg",
      "images\\snake\\Sponge_bob_taught_me_the_difference_between_Sea_sn_1.jpg"
    ]
  },
  {
    "title": "I saw a snake in a dream, the next day my boyfriend was wearing it’s colors",
    "link": "https://old.reddit.com/r/Dreams/comments/1mjj68p/i_saw_a_snake_in_a_dream_the_next_day_my/",
    "body": "So everything started yesterday when i was scrolling on tiktok and a video titled « tell me your best grandma tips that worked for you », most of the comments were like blow the moon a kiss so she’ll protect you or drink turmeric water for digestion problems, but the one that stuck with me was «  if you ever see a snake in a dream don’t forget it’s colors, if you see somebody wearing them the next day, their an ennemy, it happened twice, and ended up being true both times » that same night, I dreamt of my boyfriend and I, and there were two snakes, one black and red, the second one black, beige and red, once i saw this i woke up instantly, brushed it off then went back to sleep. The next day i had plans with my boyfriend, he was wearing a striped shirt, with black, beige and red and i somehow remembered the comment, searched for the tiktok because i had saved it but i didn’t find anything. This genuinely fucked with my brain a little and idk what to think about it, what do you think ?",
    "images": []
  },
  {
    "title": "Have you ever dreamed of snakes?",
    "link": "https://old.reddit.com/r/Dreams/comments/1m5jecq/have_you_ever_dreamed_of_snakes/",
    "body": "I've dreamed about snakes many times, but this time was different. There were nests and nests of them everywhere, of all sizes. What does that mean?",
    "images": []
  },
  {
    "title": "Normally if I dream of animals they are snakes or wolves and you?",
    "link": "https://old.reddit.com/r/Dreams/comments/1d4srgc/normally_if_i_dream_of_animals_they_are_snakes_or/",
    "body": "I have dreams where there's a room in my house that I forgot about, with a bunch of dead/dying small pets (mice, geckos) that I guess I also forgot about? Also have dreams about scary black dogs or protecting my cat in dangerous situations.",
    "images": [
      "images\\snake\\Normally_if_I_dream_of_animals_they_are_snakes_or__0.jpg",
      "images\\snake\\Normally_if_I_dream_of_animals_they_are_snakes_or__1.jpg",
      "images\\snake\\Normally_if_I_dream_of_animals_they_are_snakes_or__2.jpg",
      "images\\snake\\Normally_if_I_dream_of_animals_they_are_snakes_or__3.jpg",
      "images\\snake\\Normally_if_I_dream_of_animals_they_are_snakes_or__4.jpg",
      "images\\snake\\Normally_if_I_dream_of_animals_they_are_snakes_or__5.jpg",
      "images\\snake\\Normally_if_I_dream_of_animals_they_are_snakes_or__6.jpg",
      "images\\snake\\Normally_if_I_dream_of_animals_they_are_snakes_or__7.jpg"
    ]
  },
  {
    "title": "Had a dream I was bitten by a snake and then drove home to find one of my fence. What does it mean?",
    "link": "https://old.reddit.com/r/Dreams/comments/1f3qvq2/had_a_dream_i_was_bitten_by_a_snake_and_then/",
    "body": "Hi all, My dog passed away on Tuesday (27.08) and it was pretty hard to get to sleep that night but when I did I had a dream that I was bitten by a snake in a bush similar to the one I lived near (in australia). In the dream I freaked out and was in pain and thought it was venomous but I can’t remember if anyone helped me, and it kinda cut off after that. Anyways on Wednesday night I come home and am about to pull into my driveway when I see a massive carpet python. I’m usually a skeptic and think it’s a coincidence but it is winter here in australia, albeit a warm one, and I’m not sure if it’s a sign of something. Not sure if my dog passing that day is relevant but I just thought it’s weird for me to dream about something unrelated to my dog.",
    "images": [
      "images\\snake\\Had_a_dream_I_was_bitten_by_a_snake_and_then_drove_0.jpg",
      "images\\snake\\Had_a_dream_I_was_bitten_by_a_snake_and_then_drove_1.jpg",
      "images\\snake\\Had_a_dream_I_was_bitten_by_a_snake_and_then_drove_2.jpg",
      "images\\snake\\Had_a_dream_I_was_bitten_by_a_snake_and_then_drove_3.jpg",
      "images\\snake\\Had_a_dream_I_was_bitten_by_a_snake_and_then_drove_4.jpg",
      "images\\snake\\Had_a_dream_I_was_bitten_by_a_snake_and_then_drove_5.jpg"
    ]
  },
  {
    "title": "Do snakes have any symbolism in dreams?",
    "link": "https://old.reddit.com/r/Dreams/comments/1nr8979/do_snakes_have_any_symbolism_in_dreams/",
    "body": "Had a dream last night with a bunch of snakes around me does anyone know what this could mean?",
    "images": []
  },
  {
    "title": "I continue to dream of mazes, snakes and twigs. So I have painted them.",
    "link": "https://old.reddit.com/r/Dreams/comments/uu2u8h/i_continue_to_dream_of_mazes_snakes_and_twigs_so/",
    "body": "What a beautiful painting! I love it",
    "images": [
      "images\\snake\\I_continue_to_dream_of_mazes__snakes_and_twigs__So_0.jpg",
      "images\\snake\\I_continue_to_dream_of_mazes__snakes_and_twigs__So_1.jpg"
    ]
  },
  {
    "title": "Snake dream?",
    "link": "https://old.reddit.com/r/Dreams/comments/1n0qlxt/snake_dream/",
    "body": "(Not my photo) I had a dream about a giant grey snake (like the one in photo, but a lot bigger). In the dream the snake came out from under a wooden porch (at a house I’d never been to) and wrapped around my legs, anytime I would move or breathe, the snake would stand up and watch me.. I would be terrified and try not to move or breathe.. the snake never hurt me and when it would stand up and look at me it was more interested in what I was doing.. but to me it felt malicious and I felt fear. The snake eventually went back under the porch and the other people there kept trying to get it out and I was crying, begging, and scared asking them to leave it alone. There was another brown patterned snake equally as large that was under the porch, but never interacted with me or came out from under the porch.\n\nI’m confused by the dream and what my subconscious is trying to get across. 😅",
    "images": [
      "images\\snake\\Snake_dream__0.jpg",
      "images\\snake\\Snake_dream__1.jpg"
    ]
  },
  {
    "title": "Bitten by a decapitated snake",
    "link": "https://old.reddit.com/r/Dreams/comments/1nhhguv/bitten_by_a_decapitated_snake/",
    "body": "I had a very strange dream today which I feel like has some meaning. I’m not into such stuff usually but recently some strange things have been happening around me and I try to examine every single detail I can.\n\nBasically me and 4 of my friends (one is my friend’s girlfriend) were walking in the woods. the woods seemed familiar as if I was there once on a school trip. On the ground there were bunch of different animals (mainly insects and mostly reptiles).\n\nThere was one big snake that I remember and somewhere near it was a head of a clearly large snake. The head had a triangleish shape and it was very creepy so I assumed it was poisonous.\n\nWe continued walking and one of my friends picked up the snake’s head and hit me with it. He hit me on my forearm and it somehow bit me or transferred venom or something. My hand started bleeding immediately I had a very nasty cut on my head as if I was hit by acid. My hand was burning with pain and I started screaming at my friend. I then started panicking and asked them to take me to the hospital and woke up immediately.\n\nNow the weird thing is that 3 days ago we went to my friend’s girlfriend’s (yes the one who was in my dream) country house for 2 days. After the first night my friend’s girlfriend started shouting my name and when I answered she was crying and said that I killed myself in her dream. Later on absolutely everyone said that they had nightmares and I was the only one who didn’t even see a dream let alone a nightmare.\n\nidk maybe I’m just mumbling but if maybe anyone understands dreams better than me could explain what it all (or at least my dream) means.",
    "images": []
  },
  {
    "title": "being gifted snakes",
    "link": "https://old.reddit.com/r/Dreams/comments/1nh1cde/being_gifted_snakes/",
    "body": "i had like 3 dreams where i was gifted tiny and slimy snakes looking like tyeh just hatced by people i trust. one my friend, other my father. i didnt know what to do with these snakes, i was weirded out but also felt bad for the snakes since they are living breathing animals. it always end with me throwing them out the window in a panic, and the person in front of me laughs like they just pulled a prank. what are your toughts on what this could mean?",
    "images": []
  },
  {
    "title": "Snakes in body",
    "link": "https://old.reddit.com/r/Dreams/comments/1ns5fbq/snakes_in_body/",
    "body": "Hello, I had a dream where I swam in a lake trying to help someone and came out with my body invaded with snakes, they were burgundy color. Some small with little fangs others big and patterned. I was pulling them out of my skin but it was paralyzing me. I felt fear in the dream, like I couldn't keep up trying to get them all. I had to wake up from this one. Any ideas on the possible meaning? TIA!",
    "images": []
  },
  {
    "title": "Need help interpreting this snake dream",
    "link": "https://old.reddit.com/r/Dreams/comments/1n2vji7/need_help_interpreting_this_snake_dream/",
    "body": "Context: Got married few months back and currently planning a trip with another married couple.\n\nI saw us on a vacation, we were in a beautiful house. Felt like a beach house. I don’t know exactly why but me and the other girl decided to take pregnancy tests one after the other just like that. We talked about how we were afraid of the bathroom cuz there are lizards there. Anyway, she went in and came out and showed me a dark and a faint line & then I went in and came out with two dark lines. I went to look for my husband but couldn’t find him so I went back to the bathroom to take a shower but the moment I entered I saw a snake sitting behind the toilet seat, there were lizards all around the room and the snake was eating the lizards one by one. The snake was black & golden in color, and it was huge, the size of a human maybe? It was a really long and thick snake, and it had arms? I don’t know how else to describe it. I got scared and shut the door & got hold of my husband and friends and took them out. The dream then transitioned into another dream soon after this.\n\nHow do I interpret it? Im at a time in life where I have many incomplete progressions and in a few days I will get to check for a new job’s result, a pregnancy result, and a visa acceptance result.",
    "images": []
  },
  {
    "title": "I saw this in a dream and don't know what it could mean.",
    "link": "https://old.reddit.com/r/Dreams/comments/164ookn/i_saw_this_in_a_dream_and_dont_know_what_it_could/",
    "body": "Context: I had a dream a day or two ago when I napped. I was about to sleep for good when i had a really weird experience. I learned everything, became a singularity, then I forgot everything and this image flashed in my mind before I woke up with a headache in a really weird part of my head. It was in the center of my head, but more on the right.\n\nThe headache didn't spread anywhere else, it didn't reach the sides of my head, it just stayed in the center offset to the right. I didn't take any substances before I slept or after.\n\nCan anyone tell me what this means?",
    "images": [
      "images\\snake\\I_saw_this_in_a_dream_and_don_t_know_what_it_could_0.jpg",
      "images\\snake\\I_saw_this_in_a_dream_and_don_t_know_what_it_could_1.jpg",
      "images\\snake\\I_saw_this_in_a_dream_and_don_t_know_what_it_could_2.jpg"
    ]
  },
  {
    "title": "Bitten by a decapitated snake",
    "link": "https://old.reddit.com/r/Dreams/comments/1nhhgor/bitten_by_a_decapitated_snake/",
    "body": "I had a very strange dream today which I feel like has some meaning. I’m not into such stuff usually but recently some strange things have been happening around me and I try to examine every single detail I can.\n\nBasically me and 4 of my friends (one is my friend’s girlfriend) were walking in the woods. the woods seemed familiar as if I was there once on a school trip. On the ground there were bunch of different animals (mainly insects and mostly reptiles).\n\nThere was one big snake that I remember and somewhere near it was a head of a clearly large snake. The head had a triangleish shape and it was very creepy so I assumed it was poisonous.\n\nWe continued walking and one of my friends picked up the snake’s head and hit me with it. He hit me on my forearm and it somehow bit me or transferred venom or something. My hand started bleeding immediately I had a very nasty cut on my head as if I was hit by acid. My hand was burning with pain and I started screaming at my friend. I then started panicking and asked them to take me to the hospital and woke up immediately.\n\nNow the weird thing is that 3 days ago we went to my friend’s girlfriend’s (yes the one who was in my dream) country house for 2 days. After the first night my friend’s girlfriend started shouting my name and when I answered she was crying and said that I killed myself in her dream. Later on absolutely everyone said that they had nightmares and I was the only one who didn’t even see a dream let alone a nightmare.\n\nidk maybe I’m just mumbling but if maybe anyone understands dreams better than me could explain what it all (or at least my dream) means.",
    "images": []
  },
  {
    "title": "2 large green snakes",
    "link": "https://old.reddit.com/r/Dreams/comments/1nc3h2o/2_large_green_snakes/",
    "body": "I dreamt I was happily, peacefully walking on a hill or a mountain that had lots of trees. It was a sunny day yet there were shades and it was also breezy. When I was about to reach my destination, I suddenly saw 2 large green snakes right at the pathway that I needed to take to reach my destination. I was immobilized with fear but saw that there was already a man at my destination so I was wondering how he got there with the snakes in the way. What the guy did next was he went towards me but he avoided the snakes by taking a different path I didn’t know before, and then when he reached me, he pulled me into the path he just took, helping me to get to the destination while avoiding the snakes.\n\nAnyone know what does this mean? It’s been on my mind since…",
    "images": []
  },
  {
    "title": "A dream about zombie like people, a tree portal, and a giant snake.",
    "link": "https://old.reddit.com/r/Dreams/comments/1nlk09b/a_dream_about_zombie_like_people_a_tree_portal/",
    "body": "The dream started off with me in the woods looking at the top of a hill from the bottom, and I see what looks like zombie like people chasing people and children, terrorizing them.\n\nI think after I saw this I ran away looking for help into the woods on this trail. As I’m going through the trail I’m stopped by somebody on a horse. They then proceed to guide me on this trail.\n\nAs we progress he tells me something along the lines of “well here’s your stop” and as I turned around to make sure it was, he was gone.\n\nI notice I’m right back where I was, the bottom of this hill looking at the top and I see exactly what I see at the beginning of the dream.\n\nI see what looks like wooden clubs on the ground and my first thought was to use it on these zombies to defend these people and children, but it seemed to have no effect.\n\nThese zombie like people start chasing me and a few other people, and while they’re chasing us, we start to circle around this tree trying to lose them. All of a sudden a door opened up in one of the trees. 2 people made it through before I barely made it. As I emerged to the other side of this door, my vision was filled with bright light, and then darkness. The voice of the man on the horse back emerges and tells me “and once the giant snake got through the doors, the doors were sealed for eternity”.\n\nThis dream feels very strange to me and very symbolic, would love anyone’s insights into this.",
    "images": []
  },
  {
    "title": "Had a super vivid dream about a long purple snake chasing me",
    "link": "https://old.reddit.com/r/Dreams/comments/1nrh27e/had_a_super_vivid_dream_about_a_long_purple_snake/",
    "body": "Trying to keep this as short as possible but here’s a TLDR: I was at a really nice hotel somewhere tropical and this really long and pretty purple snake chased me around this swimming pool arena for a really long time. There were several times the snake jumped at me and almost bit me in the face but at the last second someone caught or stopped it, but every time it was subdued the dream reset and the snake was chasing me all over again.\n\nThoughts?\n\nFull version: The other night I had the most surreal dream I might have ever had. It started out in this hotel room. I was in this really nice hotel that was very expensive looking and in the tropics somewhere. There was a chest at the edge of the bed that the snake came out of like it was a gift from the hotel or some kind of performance and it felt like it was supposed to be the hotel’s way of showing off how exotic and regal they are.\n\nSuddenly cut to these really nice pools in the hotel. Really it was weird because the pools were like this giant arena style where there was a ton of seating up above and the pools and sand were down below in the center. I was up at the top and suddenly my sister and her sons were there with me. The snake followed me there from the room and that’s when the chasing began. I knew it was there for me but it was also kind of terrorizing everyone else there too. It wasn’t chasing them but it was scaring them while it slithered around everywhere and went into the pool which looked disturbing watching a giant snake in a pool with people from above where I was. Some people would scream and run away or watch the snake while it slithered around. Other people had no reaction and didn’t freak out at all to it being in the pool with them, or would calmly just get out like it was no big deal.\n\nIn between all this it would come back around and bother us again. It was chasing me but since I was with my sister and little nephews they were scared too and we were trying to keep them with us instead of running off. One’s two years old so I was anxious if he wasn’t close to us because he can’t run fast.\n\nThere several were times the snake would jump at me, and my sister or someone random would grab and hold it by the back of its head just before it can bite me in the face. Sometimes they would try to defang the snake by ripping its fangs out (I think that just came from the newer Jumanji movie that I had watched recently), so even if I got bit it couldn’t poison me, but it would never work. That close call happened multiple times and whenever the snake was subdued it’s like the dream would just reset and it was chasing me around the pool arena again.\n\nSuddenly my brother shows up out of nowhere too and he’s trying to help me run. Same things happen. I’d keep running from it, not being able to get away, people would eventually help hold it back by pulling at its tail so it wouldn’t get to me or they would hold its head down on the ground so it couldn’t move or bite, then it was back to being free and chasing me all over again.\n\nI called 911 or animal control at some point and they never came. At the end I ran out to the hotel lobby with my brother because the snake was distracted and had its “back” to me but of course it followed me out. Same thing where it scares all the people in the lobby and it almost bites me until someone stops it. With all the close calls I don’t remember ever actually getting bitten or feeling it, but at one point at the end it was like I saw myself from someone else’s POV and there were bite marks all over my face and arms. Even though I anticipated the snake being poisonous nothing happened, but dream me felt like she was going crazy after all of that.\n\nEnd of dream.\n\nThat’s when I finally woke up from all the panic I was feeling. I was disoriented for a while and wanted to go back to sleep since I was tired but knew if I did that the dream would just continue. It still felt real for a while and I still had images of the snake biting me during that morning after. That whole day afterwards the thought of a snake stressed me out all over again.\n\nWhen I was awake later I found myself wondering why there was never a point where any of us just tried to kill it. I know it’s a dream but realistically after all that chaos went on for so long you’d think someone would try to harm or kill it with something in order to finally stop it, but we were all either running or playing defense the whole time.\n\nI’ve never had a dream like that before and definitely never one with snakes. But my bad dreams are usually of being chased by something unseen. It’s always right on my tail and feels like I’m running for forever. Or the other one I have repeatedly sometimes is where I’m trying to get to class in a rush and I just can’t get there no matter what and I feel so anxious about being late or missing it altogether.\n\nI looked up the significance of purple snakes and being chased by snakes on Google and got a ton of varied explanations that were pretty consistent across different sites. I personally think the nice hotel detail specifically has been because I’ve been in need of a vacation for a long time with how stressful my life has been these past several years, and all of my immediate family has gotten to go on really nice vacations lately. My mom went to Hawaii last year. My sister and her kids went to Puerto Rico. My brother went to Guatemala earlier this year, he just got back from Paris last week and he’s going to Vienna next week. I’ve been glad for them but I’ve also obviously been wishing I could do those things too and I doubt I’ll be able to any time soon.\n\nAnyone have thoughts or insights or any similar dream/nightmare?",
    "images": []
  },
  {
    "title": "Snakes",
    "link": "https://old.reddit.com/r/Dreams/comments/1nq3exs/snakes/",
    "body": "Sooo I’m always dreaming about snakes (not everyday) but like monthly there would be dreams about snakes since like the 2ndQ of the year. It ranges from me almost getting bitten, being bitten, killing one, or just then existing in my dreams. Sometimes I would feel afraid, sometimes nothing. But now when I remember I dreamed of them Im just finding it curious. I would like to know why? I am not seing lots of friends right now, not in a relationship so Im not sure if it just really means betrayal. So if anyone could offer something, thank you.\n\nP.S. I also found a snake in our toilet few months ago. Been living in that house for 3 yrs and it was the first time that ever happened. Also the snake dream was already happening even before this happened.",
    "images": []
  },
  {
    "title": "I dreamed of a giant snake",
    "link": "https://old.reddit.com/r/Dreams/comments/1l72rko/i_dreamed_of_a_giant_snake/",
    "body": "I dreamt that I handshook a giant snake with an arm. The Handshake was like that of \"real grip of a mark master mason.\" Also, in my dream, there were two of me, the other one was being coiled around by the giant snake and the other one was just standing and watching what was happening. I can still remember the memories of the 2 me simultaneously. After the handshake, the snake let go off me.\n\nWhat could be the possibly meaning of this?",
    "images": []
  },
  {
    "title": "I keep dreaming of Snakes all over the Floor",
    "link": "https://old.reddit.com/r/Dreams/comments/1nm3jry/i_keep_dreaming_of_snakes_all_over_the_floor/",
    "body": "Every so often I will have a dream where I’m doing something (vague I know) and there will be snakes all over the floor, typically in outdoor settings. The snakes are usually unbothered and don’t care that I’m there, but they are everywhere I try to step, so walking takes a lot of conscious thought in my dreams. In the dream I’m usually a little spooked that there are snakes everywhere as well but not terrified. I’ve already read that it can be related to toxicity in terms of relationships but I have no conscious or subconscious feelings of toxicity from anyone I interact with. Thought I’d try to get insight because the dream will present in the same way every like 5 or 6 months or so, maybe longer. Any insight is appreciated, thank you!",
    "images": []
  },
  {
    "title": "Why do I keep dreaming of snakes?",
    "link": "https://old.reddit.com/r/Dreams/comments/1lcrvoq/why_do_i_keep_dreaming_of_snakes/",
    "body": "Since I was little this has been a constant problem. In this dream it was the color of Nemo and was hiding under the foot mat. The front door was open and it bit my nephew then I tried to help get him to the car and the snake kept trying to stop us from doing so. I woke up while we were still trying to evade it to get him to the car. The whole time it was hiding and would only come back out to stop us from getting him some help. So it was hard to kill or evade",
    "images": []
  },
  {
    "title": "I haven’t dreamt in years, now I’m being overrun by snakes when I close my eyes",
    "link": "https://old.reddit.com/r/Dreams/comments/1mlryzo/i_havent_dreamt_in_years_now_im_being_overrun_by/",
    "body": "I didn’t list this as recurring because the surrounding factors change, though the core remains the same. Every time, I’m trying to get away from the snakes. First, I was adopted by a family in a different country (I think Australia but I’m not sure in all honesty) and their house was partially underwater. I’d swing on vines like Tarzan in my efforts to avoid the snakes in the water (I remember feeling amazed that the rest of the family would just chill in the water in the living room watching tv - just bizarre!) in the end I ran away, trying to find a place that felt safe (Aka without snakes) swinging vine to vine, scrambling over trees, etc. in the end, I didn’t make it, but for some reason my spirit watched 2 men and 2 women in a huge treehouse near where I died. They were looking for me, but ended up finding a cave opening in the treehouse, deciding I must be in there and dead…they just…bricked it up. Today’s dream was similar but different - I lived in a pretty nice house with my two toddler boys, but when a friend came over I decided to deep clean since she was occupying the kids. That’s when I started finding the snakes. In old fridges in my porch, in my pile of laundry, under my furniture. The more I swept them outside, the more appeared. I even saw a rattlesnake, but it just shook its tail and stared at my friends leg with its mouth wide open - it’s was ready to bites, but it didn’t.\n\nI haven’t dreamt at all in years, then this week it’s been nothing but snakes and escape! Any ideas on what it all means would be great",
    "images": []
  },
  {
    "title": "I Had a Dream that a blue,fat, spiky snake bit me, meaning??",
    "link": "https://old.reddit.com/r/Dreams/comments/1njg52y/i_had_a_dream_that_a_bluefat_spiky_snake_bit_me/",
    "body": "At first my family and I were outside a random house looking for something and then we see a dead big reptile creature of some sort (I assume my brain made the animal up) and we were all like “aww that’s sad” then out of nowhere this spiky, fat, bright blue snake comes out of this small space and it is at first chasing my mom and she gets away and then it starts focusing on me. It chases me all around the yard but eventually it is on me and bites me right in the chest and is hanging there and someone else has to knock it off me. And even once it’s off it’s still only chasing me. After that for some reason I had to swim to the hospital in the ocean and as i’m swimming in the ocean i’m getting stung and bit multiple times. The bright side of the ocean part was I got to see a sea turtle and its baby and that was very cool. Anyways please tell me the meaning I’m kinda freaking out",
    "images": []
  }
]